//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ПреобразоватьЗначение")
		.ДобавитьТест("СверкаКартинокТабличныхДокументов_ОдинаковыеКартинки_Равны")
			.СПараметрами("Запуск", "Запуск").Представление("Одинаковые картинки")
			.СПараметрами("R1:R6", "R1C1:R6C4").Представление("Несколько одинаковых картинок")
			.СПараметрами("R1:R6", "R1C1:R6C4").Представление("Несколько одинаковых картинок")
			.СПараметрами("ВнешняяКартинка", "ВнешняяКартинка").Представление("Одинаковые картинки из файла")
		.ДобавитьТест("СверкаКартинокТабличныхДокументов_РазноеКоличествоКартинок_НеСовпадают")
			.СПараметрами("Запуск", "R1:R6").Представление("Разное количество картинок")
			.СПараметрами("Запуск", "R60").Представление("Разное количество картинок, область без картинок справа")
			.СПараметрами("R60", "Запуск").Представление("Разное количество картинок, область без картинок слева")
		.ДобавитьТест("СверкаКартинокТабличныхДокументов_РазныеКартинки_НеСовпадают")
			.СПараметрами("ВнешняяКартинка", "Запуск", "Строка, Колонка, Картинка").Представление("Разные картинки")
			.СПараметрами("Запуск", "Запуск2", "Строка, Колонка").Представление("Одинаковые картинки, но с разным размером")
			.СПараметрами("Запуск", "R2:R4", "Строка").Представление("Одинаковые картинки, но с разной позицией")
	;
	
КонецПроцедуры

Процедура ПреобразоватьЗначение() Экспорт
	
	Варианты = ЮТест.Варианты("Значение, Тип, Результат")
		.Добавить("2022", "Число", 2022)
		.Добавить(2022, "Число", 2022)
		.Добавить("Да", "Булево", Истина)
		.Добавить("2022-01-01T10:15:12", "Дата", '20220101101512')
		.Добавить("2022-01-01", "Дата", '20220101')
		.Добавить("10:15:12", "Время", '00010101101512')
		.Добавить("2022-01-01T10:15:12", "Время", '00010101101512')
		.СписокВариантов();
		
	Для Каждого Вариант Из Варианты Цикл
		Результат = РатШагиВанессыСервер.ПреобразоватьЗначение(Вариант.Значение, Вариант.Тип);
		Описание = СтрШаблон("Не удалось преобразовать значение `%1` к типу `%2`", Вариант.Значение, Вариант.Тип);
		ЮТест.ОжидаетЧто(Результат, Описание)
			.Равно(Вариант.Результат);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СверкаКартинокТабличныхДокументов_ОдинаковыеКартинки_Равны(ИмяОбласти1, ИмяОбласти2) Экспорт
	
	Описание = СтрШаблон("Справнение областей '%1' vs '%2'", ИмяОбласти1, ИмяОбласти2);
	
	ТабДок1 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти1);
	ТабДок2 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти2);
	
	Результат = РатШагиВанессыСервер.СверкаКартинокТабличныхДокументов(ТабДок1, ТабДок2);
	
	ЮТест.ОжидаетЧто(Результат, Описание)
		.Заполнено()
		.ИмеетТип("Структура")
		.Свойство("НесовпадающиеКартинки").НеЗаполнено()
		.Свойство("Совпадают").ЭтоИстина()
		.Свойство("КоличествоСовпадает").ЭтоИстина()
	;
	
КонецПроцедуры

Процедура СверкаКартинокТабличныхДокументов_РазноеКоличествоКартинок_НеСовпадают(ИмяОбласти1, ИмяОбласти2) Экспорт
	
	Описание = СтрШаблон("Справнение областей '%1' vs '%2'", ИмяОбласти1, ИмяОбласти2);
	
	ТабДок1 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти1);
	ТабДок2 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти2);
	
	Результат = РатШагиВанессыСервер.СверкаКартинокТабличныхДокументов(ТабДок1, ТабДок2);
	
	ЮТест.ОжидаетЧто(Результат, Описание)
		.Заполнено()
		.ИмеетТип("Структура")
		.Свойство("КоличествоСовпадает").ЭтоЛожь()
		.Свойство("Совпадают").ЭтоЛожь()
	;
	
КонецПроцедуры

Процедура СверкаКартинокТабличныхДокументов_РазныеКартинки_НеСовпадают(ИмяОбласти1, ИмяОбласти2, ОжидаемыеРазличия) Экспорт
	
	Описание = СтрШаблон("Справнение областей '%1' vs '%2'", ИмяОбласти1, ИмяОбласти2);
	
	ТабДок1 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти1);
	ТабДок2 = ЮТОбщий.Макет("ОбщийМакет.ОМ_РатШагиВанессыСервер_СравнениеКаринок." + ИмяОбласти2);
	
	Результат = РатШагиВанессыСервер.СверкаКартинокТабличныхДокументов(ТабДок1, ТабДок2);
	
	ЮТест.ОжидаетЧто(Результат, Описание)
		.Заполнено()
		.ИмеетТип("Структура")
		.Свойство("КоличествоСовпадает").ЭтоИстина()
		.Свойство("Совпадают").ЭтоЛожь()
		.Свойство("НесовпадающиеКартинки").Заполнено()
		.Свойство("НесовпадающиеКартинки[0]").Равно("Картинка №1, отличия: " + ОжидаемыеРазличия)
	;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
