//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Десериализует типизированное значение.
//
// Параметры:
//   Значение - Произвольный - значение для десериализации
//
// Возвращаемое значение:
//   Произвольный - десериализованное значение
//
// Пример:
//   Значение = РатПреобразованияВызовСервера.ДесериализоватьТипизированноеЗначение(ТипизированноеЗначение);
//
Функция ДесериализоватьТипизированноеЗначение(Знач Значение) Экспорт
	
	СтатусОбработкиЗапроса = РатОбщий.НовыйСтатусОбработкиЗапроса();
	Результат = РатПреобразования.ДесериализоватьТипизированноеЗначение(Значение, СтатусОбработкиЗапроса);
	
	Если НЕ СтатусОбработкиЗапроса.Успешно Тогда
		ВызватьИсключение СтатусОбработкиЗапроса.ОписаниеОшибки[0].Текст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Сериализует значение.
//
// Параметры:
//   Значение - Произвольный - значение для сериализации
//
// Возвращаемое значение:
//   Произвольный - сериализованное значение
//
// Пример:
//   СериализованноеЗначение = РатПреобразованияВызовСервера.СериализоватьЗначение(Значение);
//
Функция СериализоватьЗначение(Знач Значение) Экспорт
	
	Возврат РатПреобразования.СериализоватьЗначение(Значение);
	
КонецФункции

#КонецОбласти
