//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Конструктор команды для клиента тестирования.
// Формирует пустое описание (структуру) команды, 
// которую требуется выполнить на клиенте тестирования.
// 
// Возвращаемое значение:
//  Структура - Новая команда:
// * Метод - Строка - полный путь к методу на клиенте тестирования (сигнатура метода без параметров)
// * Параметры - Массив Из Произвольный - коллекция для указания параметров метода (параметры указываются в соответствующем порядке) 
// * ТаймаутОжиданияОтвета - Число - максимальное время в секундах ожидания обработки выполнения команды (по умолчанию 60 с)
Функция НоваяКоманда() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Метод", "");
	Результат.Вставить("Параметры", Новый Массив);
	Результат.Вставить("ТаймаутОжиданияОтвета", 60); // BSLLS:MagicNumber-off
	
	Возврат Результат;
	
КонецФункции

// Выполняет метод (описываемый командой) на клиенте тестирования
// 
// Параметры:
//  Ванесса - Произвольный - контекст фреймворка Vanessa-Automation
//  Команда - см. НоваяКоманда
// 
// Возвращаемое значение:
//  Произвольный - результат выполнения метода команды на клиенте тестирования
Функция ВыполнитьКоманду(Ванесса, Команда) Экспорт

	Возврат РатВзаимодействиеСКлиентомТестированияКлиент.ВыполнитьКоманду(Ванесса, Команда);

КонецФункции

#КонецОбласти
