//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура Пауза(Секунд) Экспорт
	
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();
	
	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Секунд);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("ПУБ_РегламентныеЗаданияСлужебный.Пауза", Параметры); // Тут указываем имя общего модуля, в котором лежит данная процедура
	КонецЕсли;
	
	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Секунд);
	Исключение
		Возврат;
	КонецПопытки;
	
КонецПроцедуры

// Выполняет произвольный алгоритм
// 
// Параметры:
//  Алгоритм - Строка - Алгоритм
Процедура ПроизвольныйАлгоритм(Алгоритм) Экспорт
	
	//@skip-check server-execution-safe-mode
	Выполнить(Алгоритм);
	
КонецПроцедуры

Процедура ФоноваяБлокировка(Область = "Справочник.ПУБ_ОбъектыМетаданных", Время = 30) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Область).Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	//@skip-check lock-out-of-try
	Блокировка.Заблокировать();
	
	Пауза(Время);
	
КонецПроцедуры

#КонецОбласти
