//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных()
		.ДобавитьТест("Поиск")
	;
	
КонецПроцедуры

Процедура Поиск() Экспорт
	
	Период = ТекущаяДата();
	ЮТест.Данные().КонструкторОбъекта("Справочники.ПУБ_ОбъектыМетаданных")
		.Установить("Наименование", "Пользователи")
		.Установить("Тип", ПредопределенноеЗначение("Перечисление.ПУБ_ТипыОбъектов.Справочник"))
		.Записать();
	
	Ссылка = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_ОбъектыМетаданных");
	Ссылка2 = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_ОбъектыМетаданных");
	
	ЮТест.Данные().КонструкторОбъекта("РегистрыСведений.ПУБ_КомментарииПоОбъекту")
		.Установить("Объект", Ссылка)
		.Установить("Период", Период)
		.ДобавитьЗапись()
		.Установить("Объект", Ссылка2)
		.ДобавитьЗапись();
	
	ПростойОтбор = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         |
	|| --------------- | ------------ |
	|| Наименование    | Пользователи |
	|| Тип             | Справочник   |
	|| ПометкаУдаления | Ложь         |");
	ТипизированныйОтбор = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         | Кол3                 |
	|| --------------- | ------------ | -------------------- |
	|| Наименование    | Пользователи | string               |
	|| Тип             | Справочник   | EnumRef.ПУБ_ТипыОбъектов |
	|| ПометкаУдаления | Ложь         | boolean              |");
	УсловиеВСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2                 | Кол3    |
	|| --------------- | -------------------- | ------- |
	|| Реквизит        | Значение             | Условие |
	|| Наименование    | Пользователи         |         |
	|| Тип             | Справочник; Документ | ВСписке |
	|| ПометкаУдаления | Ложь                 | Равно   |");
	УсловиеВПустомСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2         | Кол3    |
	|| --------------- | ------------ | ------- |
	|| Реквизит        | Значение     | Условие |
	|| Наименование    | Пользователи |         |
	|| Тип             |              | ВСписке |
	|| ПометкаУдаления | Ложь         | Равно   |");
	УсловиеТипизированномВСписке = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1            | Кол2                     | Кол3    | Кол4                 |
	|| --------------- | ------------------------ | ------- | -------------------- |
	|| Реквизит        | Значение                 | Условие | Тип                  |
	|| Наименование    | Пользователи             |         |                      |
	|| Тип             | Справочник; Перечисление | ВСписке | EnumRef.ПУБ_ТипыОбъектов |
	|| ПометкаУдаления | Ложь                     | Равно   |                      |");
	
	УсловиеПоСоставномуРеквизиту = ЮТест.Данные().ТаблицаMarkDown(СтрШаблон(
	"| Кол1     | Кол2     | Кол3           | Кол4                         |
	|| -------- | -------- | -------------- | ---------------------------- |
	|| Реквизит | Значение | Условие        | Тип                          |
	|| Объект   | %1;%2    | ВСписке        | CatalogRef.ПУБ_ОбъектыМетаданных |
	|| Период   | %3       | БольшеИлиРавно |                              |",
	Ссылка, Ссылка2, Формат(Период, "ДФ=yyyy-MM-ddTHH:mm:ss;")));
	
	Варианты = ЮТест.Варианты("Описание, Адрес, Условия, Количество")
		.Добавить("Простой отбор", "Справочник/ПУБ_ОбъектыМетаданных", ПростойОтбор, 1)
		.Добавить("Типизированный отбор", "Справочник/ПУБ_ОбъектыМетаданных", ТипизированныйОтбор, 1)
		.Добавить("Отбор в списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеВСписке, 1)
		.Добавить("Отбор в пустом списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеВПустомСписке, 0)
		.Добавить("Отбор в типизированном списке", "Справочник/ПУБ_ОбъектыМетаданных", УсловиеТипизированномВСписке, 1)
		.Добавить("Отбор по составному реквизиту", "РегистрСведений/ПУБ_КомментарииПоОбъекту", УсловиеПоСоставномуРеквизиту, 2)
	;
	
	Для Каждого Вариант Из Варианты.СписокВариантов() Цикл
	
		Тело = РатШагиВанессыКлиент.СтруктураПоиска(Вариант.Условия);
		Ответ = ПомощникТестированияРат.ЗапросAPI(Вариант.Адрес, "GET", Тело);
		
		ЮТест.ОжидаетЧто(Ответ, Вариант.Описание + Ответ.Тело)
			.Свойство("КодСостояния").Равно(200)
			.Свойство("Данные").ИмеетТип("Массив").ИмеетДлину(Вариант.Количество);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
