//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Набор процедур оберток для шаблонизации тестов 
//  
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция Представление(Объект, Знач Уровень = 0, ПредставлениеТипа = Неопределено) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Шаблон = "%1 (%2)";
	Представление = "";
	
	Если ПредставлениеТипа = Неопределено Тогда
		ПредставлениеТипа = ТипОбъекта;
	КонецЕсли;
	
	Если ТипОбъекта = Тип("Структура")
		ИЛИ ТипОбъекта = Тип("ФиксированнаяСтруктура")
		ИЛИ ТипОбъекта = Тип("Соответствие")
		ИЛИ ТипОбъекта = Тип("ФиксированноеСоответствие") Тогда
		РатСтроки.СформироватьСтрокуСимволов(" ", Уровень * 8);
		Шаблон = "%2:
				 |%1";
		Представление = РатСтроки.СформироватьСтрокуСимволов(" ", Уровень * 8) + ПредставлениеСтруктуры(Объект, Уровень);
		
	ИначеЕсли ТипОбъекта = Тип("Массив") ИЛИ ТипОбъекта = Тип("ФиксированныйМассив") Тогда
		
		Шаблон = "%2: %1";
		ПредставленияОбъектов = Новый Массив;
		
		Для Каждого Элемент Из Объект Цикл
			ПредставленияОбъектов.Добавить(Представление(Элемент, Уровень + 1));
		КонецЦикла;
		
		Представление = СтрСоединить(ПредставленияОбъектов, "; ");
		
	ИначеЕсли ТипОбъекта = Тип("Число") Тогда
		
		Представление = XMLСтрока(Объект);
		
	ИначеЕсли ТипОбъекта = Тип("Дата") Тогда
		
		Представление = Формат(Объект, "ДФ=""dd.MM.yyyy ЧЧ:мм:сс""");
		
	ИначеЕсли ТипОбъекта = Тип("Булево") Тогда
		
		Представление = ?(Объект, "Истина", "Ложь");
		
	ИначеЕсли ТипОбъекта = Тип("Строка") Тогда
		
		Представление = Объект;
		
	Иначе
		
		Представление = Строка(Объект);
		ПредставлениеТипа = ПредставлениеТипа(ТипОбъекта); // Для ссылочных
		
	КонецЕсли;
	
	Если ПустаяСтрока(Представление) Тогда
		
		Представление = "<Пусто>";
		
	КонецЕсли;
	
	Возврат СтрШаблон(Шаблон, Представление, ПредставлениеТипа);
	
КонецФункции

#Область Проверки

Процедура ПроверитьТаблицу(Факт, Ожидание, ИмяТаблицы, СопоставитьПо = Неопределено, Колонки = Неопределено) Экспорт
	
	ЮТест.ОжидаетЧто(Факт.Количество(), СтрШаблон("%1. Не верное количество строк", ИмяТаблицы))
		.Равно(Ожидание.Количество());
	
	Если Ожидание.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТипОжидание = ТипЗнч(Ожидание);
	
	Если Колонки = Неопределено Тогда
		
		Если ТипОжидание = Тип("Массив") Тогда
			
			Колонки = Неопределено;
			
		ИначеЕсли ТипОжидание = Тип("ТаблицаЗначений") Тогда
			
			Колонки = РатКоллекции.ВыгрузитьЗначения(Ожидание.Колонки, "Имя");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Инд = 0 По Ожидание.Количество() - 1 Цикл
		
		Сообщение = СтрШаблон("%1. Проверка строки: %2.
							  |        ", ИмяТаблицы, Инд + 1);
		ЗаписьОжидаем = Ожидание[Инд];
		
		Если СопоставитьПо = Неопределено ИЛИ (Факт.Количество() = 1 И Ожидание.Количество() = 1) Тогда
			
			ЗаписьФакт = Факт[Инд];
			
		Иначе
			
			Отбор = Новый Структура(СопоставитьПо);
			ЗаполнитьЗначенияСвойств(Отбор, ЗаписьОжидаем);
			Строки = Факт.НайтиСтроки(Отбор);
			
			ПредставлениеСтроки = Представление(ЗаписьОжидаем, 2);
			
			Суффикс = СтрШаблон("%1%2%3%3Данные ожидаемой строки: %3", СопоставитьПо, Символы.ПС, Символы.Таб, ПредставлениеСтроки);
			ЮТест.ОжидаетЧто(Строки, Сообщение)
				.Заполнено("Не удалось найти соответствующую строку по " + Суффикс)
				.ИмеетДлину(1, "Найдено несколько строк для " + Суффикс);
			
			ЗаписьФакт = Строки[0];
			
		КонецЕсли;
		
		ОбъектыРавны(ЗаписьФакт, ЗаписьОжидаем, Колонки, Сообщение + "Не верное значение");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПроводки(Документ, ПолноеИмяРегистра, Ожидание, Описание, СопоставитьПо = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Документ) = Тип("Структура") Тогда
		
		Условия = Новый Массив;
		
		Для Каждого Элемент Из Документ Цикл
			
			Условия.Добавить(СтрШаблон("%1 = &%1", Элемент.Ключ));
			Запрос.УстановитьПараметр(Элемент.Ключ, Элемент.Значение);
			
		КонецЦикла;
		
		Запрос.Текст = СтрШаблон("ВЫБРАТЬ * ИЗ %1", ПолноеИмяРегистра);
		Запрос.Текст = Запрос.Текст + " ГДЕ " + СтрСоединить(Условия, " И ");
		
	Иначе
	
		Запрос.Текст = СтрШаблон("ВЫБРАТЬ * ИЗ %1 ГДЕ Регистратор = &Документ", ПолноеИмяРегистра);
		Запрос.УстановитьПараметр("Документ", Документ);
	
	КонецЕсли;
	
	Факт = Запрос.Выполнить().Выгрузить();
	
	ПроверитьТаблицу(Факт, Ожидание, СтрШаблон("%1. %2", Описание, ПолноеИмяРегистра), СопоставитьПо);
	
КонецПроцедуры

Процедура ОбъектыРавны(Объект, ОбъектЭталон, Знач Ключи = Неопределено, Описание = "") Экспорт
	
	Если Ключи = Неопределено Тогда
		
		Ключи = РатКоллекции.ВыгрузитьЗначения(ОбъектЭталон, "Ключ");
		
	ИначеЕсли ТипЗнч(Ключи) = Тип("Строка") Тогда
		 
		 Ключи = СтрРазделить(Ключи, ", ", Ложь);
		 
	КонецЕсли;
	
	Если ТипЗнч(Объект) <> Тип("Структура") И ТипЗнч(Объект) <> Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураОбъекта = Новый Структура(СтрСоединить(Ключи, ","));
		ЗаполнитьЗначенияСвойств(СтруктураОбъекта, Объект);
		
	Иначе
		
		СтруктураОбъекта = Объект;
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЭталон) <> Тип("Структура") Тогда
		
		СтруктураЭталона = Новый Структура(СтрСоединить(Ключи, ","));
		ЗаполнитьЗначенияСвойств(СтруктураЭталона, ОбъектЭталон);
		
	Иначе
		
		СтруктураЭталона = ОбъектЭталон;
		
	КонецЕсли;
	
	Суффикс = СтрШаблон("%3Ожидание: %1%3Факт: %2", Представление(СтруктураЭталона, 1), Представление(СтруктураОбъекта, 1), Символы.ПС);
	
	Для Каждого Ключ Из Ключи Цикл
		
		ЮТест.ОжидаетЧто(СтруктураОбъекта, Описание)
			.Свойство(Ключ, СтрШаблон("Фактические данные не содержат реквизит '%1'%2", Ключ, Суффикс));
		ЮТест.ОжидаетЧто(СтруктураЭталона, Описание)
			.Свойство(Ключ, СтрШаблон("Эталонные данные не содержат реквизит '%1'%2", Ключ, Суффикс));
		
		Сообщение = СтрШаблон("%1. Реквизит '%2' не совпадает%3", Описание, Ключ, Суффикс);
		
		ЭталонноеЗначение = ОбъектЭталон[Ключ];
		
		ТипЗначения = ТипЗнч(ЭталонноеЗначение);
		
		Если ТипЗначения = Тип("Структура") ИЛИ ТипЗначения = Тип("ФиксированнаяСтруктура")
			И ЗначениеЗаполнено(Объект[Ключ]) Тогда
			ОбъектыРавны(Объект[Ключ], ЭталонноеЗначение, , Сообщение);
		ИначеЕсли ТипЗначения = Тип("Массив") ИЛИ ТипЗначения = Тип("ФиксированныйМассив") Тогда
			МассивыСовпадают(Объект[Ключ], ЭталонноеЗначение, Сообщение);
		Иначе
			ЮТест.ОжидаетЧто(Объект[Ключ], Сообщение)
				.Равно(ОбъектЭталон[Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура МассивыСовпадают(Факт, Ожидание, Описание = "") Экспорт
	
	ПредставлениеФакт = Представление(Факт);
	ПредставлениеОжидание = Представление(Ожидание);
	
	Суффикс = СтрШаблон("
	|%1
	|Ожидание: %2
	|Факт: %3", Описание, ПредставлениеОжидание, ПредставлениеФакт);
	
	Утверждение = ЮТест.ОжидаетЧто(Факт)
		.ИмеетДлину(Ожидание.Количество(), "Не верное количество элементов" + Суффикс);
	
	Для Каждого Элемент Из Ожидание Цикл
		Утверждение.Содержит(Элемент, СтрШаблон("Не найден элемент %1. %2", Элемент, Суффикс));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеСтруктуры(Значение, Уровень)
	
	Строки = Новый Массив();
	
	Для Каждого Элемент Из Значение Цикл
		
		Строки.Добавить(СтрШаблон("%1 = %2", Элемент.Ключ, Представление(Элемент.Значение, Уровень + 1)));
		
	КонецЦикла;
	
	Возврат СтрСоединить(Строки, Символы.ПС + РатСтроки.СформироватьСтрокуСимволов(" ", Уровень * 8));
	
КонецФункции

Функция ПредставлениеТипа(Тип)
	
	ТипXML = СериализаторXDTO.XMLТип(Тип);
	
	Если ТипXML = Неопределено Тогда
		
		Возврат Строка(Тип);
		
	Иначе
		
		Возврат ТипXML.ИмяТипа;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
