//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ДанныеПользователя")
	;
	
КонецПроцедуры

Процедура ПередТестом() Экспорт
	
	ЮТест.Контекст().УстановитьЗначение("СозданныеПользователи", Новый Массив());
	
КонецПроцедуры

Процедура ПослеТеста() Экспорт
	
	СозданныеПользователи = ЮТест.Контекст().Значение("СозданныеПользователи");
	
	Для Каждого ИмяПользователя Из СозданныеПользователи Цикл
		
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(ИмяПользователя);
		Если Пользователь <> Неопределено Тогда
			Пользователь.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДанныеПользователя() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	Пользователь.Имя = ЮТест.Данные().СлучайнаяСтрока();
	Пользователь.Пароль = ЮТест.Данные().СлучайнаяСтрока();
	Пользователь.Роли.Добавить(Метаданные.Роли.ПУБ_Администратор);
	Пользователь.Записать();
	Результат = Неопределено;
	
	ИмяПользователя = Пользователь.Имя;
	ПараметрыЗапроса = Новый Структура("Наименование", ИмяПользователя);
	
	Статус = ВызватьОбработчик("ДанныеПользователя", ПараметрыЗапроса, Результат);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Текущий пользователь");
	
	ЮТест.ОжидаетЧто(Результат, "Данные пользователя")
		.Свойство("Имя").Равно(ИмяПользователя)
		.Свойство("УникальныйИдентификатор")
		.Свойство("ПарольУстановлен")
		.Свойство("Роли")
		.НетСвойства("Пароль")
		.НетСвойства("СохраняемоеЗначениеПароля");
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	
	ПараметрыЗапроса = Новый Структура("Наименование", ИмяПользователя + Новый УникальныйИдентификатор());
	Статус = ВызватьОбработчик("ДанныеПользователя", ПараметрыЗапроса);
	ПомощникТестированияРат.ПроверитьРезультатОшибка(Статус, "Отсутствующий пользователь", КлассыОшибок.НеНайденаЗаписьИБ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызватьОбработчик(Обработчик, ПараметрыЗапроса, Результат = Неопределено)
	
	Результат = Неопределено;
	Статус = ПомощникТестированияРат.Статус();
	ОбработчикВыполнен = Ложь;
	
	Результат = РатПользователиИнформационнойБазы.ВызватьОбработчик(Обработчик, ПараметрыЗапроса, Статус, ОбработчикВыполнен);
	
	Если НЕ ОбработчикВыполнен Тогда
		ВызватьИсключение "Обработчик не выполнен";
	КонецЕсли;
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти
