//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапросБезПараметров")
			.СПараметрами("Результат = 2 + 2;")
			.СПараметрами("Сообщить(1);")
			.СПараметрами("Справочники.ПУБ_Номенклатура.СоздатьЭлемент().Наименование = ""Тест""")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ВыводСообщений")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Примитивы")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Массив")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_ТипизированнаяПеременная")
		.ДобавитьТест("ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_МассивТипизированныхПеременных")
	;
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапросБезПараметров(Алгоритм) Экспорт
	
	Данные = ВыполнитьПроизвольныйАлгоритм(Алгоритм);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина);
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_ВыводСообщений() Экспорт
	
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(1+1);");
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages")
			.ИмеетТип("Массив")
			.ИмеетДлину(1)
			.Содержит("2");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Примитивы() Экспорт
	
	Параметры = Новый Структура("Параметр1, Параметр2, Параметр3", "1", 2);
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Параметр1 + Параметры.Параметр2);", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно("12");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_Массив() Экспорт
	
	Параметры = Новый Структура("Параметр1, Параметр2", "1", СтрРазделить("2,3,4", ","));
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Параметр1 + СтрСоединить(Параметры.Параметр2, """"));", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно("1234");
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_ТипизированнаяПеременная() Экспорт
	
	Наименование = "Тест ссылки";
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура, Наименование);
	Параметры = Новый Структура("Ссылка", РатПреобразования.СериализоватьЗначение(Ссылка));
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(Параметры.Ссылка);", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно(Наименование);
	
КонецПроцедуры

Процедура ВыполнитьПроизвольныйАлгоритм_РеальныйЗапрос_РаботаСПараметрами_МассивТипизированныхПеременных() Экспорт
	
	Наименование = "Тест ссылки";
	Ссылка = ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура, Наименование);
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(РатПреобразования.СериализоватьЗначение(Ссылка));
	Ссылки.Добавить(РатПреобразования.СериализоватьЗначение(Ссылка));
	
	Параметры = Новый Структура("Ссылки", Ссылки);
	Данные = ВыполнитьПроизвольныйАлгоритм("Сообщить(СтрСоединить(Параметры.Ссылки, ""+""));", Параметры);
	
	ЮТест.ОжидаетЧто(Данные)
		.ИмеетТип("Структура")
		.Свойство("success").Равно(Истина)
		.Свойство("messages[0]").Равно(Наименование + "+" + Наименование);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьПроизвольныйАлгоритм(Алгоритм, Параметры = Неопределено, БезопасныйРежим = Истина)
	
	Тело = Новый Структура("Алгоритм, Параметры, БезопасныйРежим", Алгоритм, Параметры, БезопасныйРежим);
	Запрос = ПомощникТестированияРат.НовыйЗапрос("ВыполнитьАлгоритм", "POST");
	Запрос.УстановитьТелоКакСтрокуJSON(Тело);
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	ПомощникТестированияРат.ПроверитьОтвет(Ответ, "Проверка успешности ответа");
	
	Возврат ПомощникТестированияРат.ОбъектИзСтроки(Ответ.ПолучитьТелоКакСтроку());
	
КонецФункции

#КонецОбласти
