//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеТаблицы = Неопределено;
	
	Если НЕ Параметры.Свойство("ОписаниеТаблицы", ОписаниеТаблицы) Тогда
		ВызватьИсключение "Некорректный вызов формы. Необходимо передать параметр с описанием таблицы";
	КонецЕсли;
	
	Список.ПроизвольныйЗапрос = Ложь;
	Список.ОсновнаяТаблица = СтрШаблон("%1.%2", ОписаниеТаблицы.ИмяТипа, ОписаниеТаблицы.Имя);
	Список.ДинамическоеСчитываниеДанных = Истина;
	
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса("ВЫБРАТЬ * ИЗ " + Список.ОсновнаяТаблица); // BSLLS:QueryParseError-off
	
	Для Каждого Колонка Из Схема.ПакетЗапросов[0].Колонки Цикл
		
		Элемент = Элементы.Добавить("Список" + Колонка.Псевдоним, Тип("ПолеФормы"), Элементы.Список);
		Элемент.ПутьКДанным = "Список." + Колонка.Псевдоним;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыборе(ВыбраннаяСтрока);
	
КонецПроцедуры

#КонецОбласти
