//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Создает корневой объект описания в формате OpenAPI v3.0.0
//   
// Возвращаемое значение:
//  Структура - Корневой объект:
// * openapi - Строка - Версия формата
// * info - см. БлокИнформацияОСервисе
// * paths - Соответствие из см. БлокПуть - Описание путей и операций сервиса
// * security - Массив из см. БлокСхемаБезопасности - Описание механизмов доступа используемых сервисом 
// * tags - Массив из см. БлокТег - Список тэгов описания
// * externalDocs - Структура - Дополнительная внешняя документация
// * servers - Массив из см. НовыйСервер - Массив объектов сервера, которые предоставляют информацию о подключении к целевому серверу.
// * components - Структура - Элемент для хранения различных схем спецификации.
//
// Пример:
//   Спецификация = СпецификацияСервиса();
//   Спецификация.info.title = "МойСервис";
//   Спецификация.info.description = "Описание моего сервиса";
//
Функция СпецификацияСервиса() Экспорт
	
	// Документация - https://swagger.io/specification/#openapi-object
	
	Блок = Новый Структура();
	Блок.Вставить("openapi", "3.0.0");
	Блок.Вставить("info", БлокИнформацияОСервисе());
	Блок.Вставить("paths", Новый Соответствие());
	Блок.Вставить("components", БлокКомпоненты());
	Блок.Вставить("security", Новый Массив());
	Блок.Вставить("tags", Новый Массив());
	Блок.Вставить("externalDocs", Новый Структура());
	Блок.Вставить("servers", Новый Массив);
	
	Возврат Блок;
	
КонецФункции

// Создает описание сервера для OpenAPI спецификации
//   
// Параметры:
//  Адрес - Строка - URL адрес сервера
//  Описание - Строка, Неопределено - Описание сервера
// 
// Возвращаемое значение:
//  Структура - Описание сервера:
// * url - Строка - URL адрес сервера
// * description - Строка - Описание сервера (если указано)
//
// Пример:
//   Сервер = НовыйСервер("https://api.example.com", "Основной сервер API");
//
Функция НовыйСервер(Адрес, Описание = Неопределено) Экспорт
	
	Блок = Новый Структура;
	Блок.Вставить("url", Адрес);
	
	Если Описание <> Неопределено Тогда
		Блок.Вставить("description", Описание);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Блок;
	
КонецФункции

// Создает описание пути (endpoint) для OpenAPI спецификации
//   
// Возвращаемое значение:
//  Структура - Описание пути:
// * summary - Строка - Краткое описание пути
// * description - Строка - Подробное описание пути
// * parameters - Массив из см. НовыйПараметр - Параметры пути
//
// Пример:
//   Путь = БлокПуть();
//   Путь.summary = "Операции с пользователями";
//   Путь.description = "Набор операций для работы с пользователями системы";
//
Функция БлокПуть() Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("summary", "");
	Блок.Вставить("description", "");
	Блок.Вставить("parameters", Новый Массив());
	
	Возврат Блок;
	
КонецФункции

// Создает описание тега для группировки операций в OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя тега
//  Описание - Строка - Описание тега
// 
// Возвращаемое значение:
//  Соответствие из Строка - Описание тега:
// * name - Строка - Имя тега
// * description - Строка - Описание тега
// * x-tag-expanded - Булево - Признак развернутого тега
//
// Пример:
//   Тег = БлокТег("Пользователи", "Операции с пользователями системы");
//
//@skip-check doc-comment-type
Функция БлокТег(Имя = "", Описание = "") Экспорт
	
	Блок = Новый Соответствие();
	Блок.Вставить("name", Имя);
	Блок.Вставить("description", Описание);
	Блок.Вставить("x-tag-expanded", Ложь);
	
	Возврат Блок;
	
КонецФункции

// Создает описание операции (HTTP метода) для OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя операции
//  Описание - Строка - Описание операции
//  Группа - Строка, Неопределено - Группа операции
// 
// Возвращаемое значение:
//  Структура - Описание операции:
// * summary - Строка - Имя операции
// * description - Строка - Описание операции
// * tags - Массив из Строка - Теги операции
// * parameters - Массив  из см. НовыйПараметр - Параметры операции
// * requestBody - Неопределено - При отсутствии тела
//               - см. БлокТелоЗапроса
// * responses - Соответствие  из см. БлокТелоОтвета - Описания ответов
//
// Пример:
//   Операция = НоваяОперация("Создание пользователя", "Создает нового пользователя в системе", "Пользователи");
//
Функция НоваяОперация(Имя, Описание = "", Группа = Неопределено) Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("summary", Имя);
	Блок.Вставить("description", Описание);
	Блок.Вставить("tags", Новый Массив());
	Блок.Вставить("parameters", Новый Массив());
	Блок.Вставить("requestBody", Неопределено);
	Блок.Вставить("responses", Новый Соответствие());
	
	Если ЗначениеЗаполнено(Группа) Тогда
		Блок.tags.Добавить(Группа);
	КонецЕсли;
	
	Возврат Блок;
	
КонецФункции

// Создает описание параметра операции для OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя параметра
//  ПоложениеПараметра - Строка - Положение параметра (path, query, header, cookie)
//  Описание - Строка, Неопределено - Описание параметра
// 
// Возвращаемое значение:
//  Структура - Описание параметра:
// * name - Строка - Имя параметра
// * description - Строка, Неопределено - Описание параметра
// * in - Строка - Положение параметра
// * required - Булево - Обязательность параметра
// * deprecated - Булево - Признак устаревшего параметра
// * allowEmptyValue - Булево - Разрешение пустого значения
//
// Пример:
//   Параметр = НовыйПараметр("userId", "path", "Идентификатор пользователя");
//
Функция НовыйПараметр(Имя, ПоложениеПараметра, Описание = Неопределено) Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("name", Имя);
	Блок.Вставить("in", ПоложениеПараметра);
	Блок.Вставить("required", Истина);
	Блок.Вставить("deprecated", Ложь);
	Блок.Вставить("allowEmptyValue", Ложь);
	Если Описание <> Неопределено Тогда
		Блок.Вставить("description", Описание);
	КонецЕсли;
	
	Возврат Блок;
	
КонецФункции

// Создает ссылку на компонент OpenAPI спецификации
//   
// Параметры:
//  ПутьКомпонента - Строка - Путь к компоненту
// 
// Возвращаемое значение:
//  Соответствие из Строка - Ссылка на объект. Содержит `$ref` - Строка - Путь к объекту схемы
//
// Пример:
//   Ссылка = БлокСсылка("#/components/schemas/User");
//   // Результат: { "$ref": "#/components/schemas/User" }
//
//@skip-check doc-comment-field-name
Функция БлокСсылка(ПутьКомпонента) Экспорт
	
	Блок = Новый Соответствие();
	Блок.Вставить("$ref", ПутьКомпонента);
	
	Возврат Блок;
	
КонецФункции

// Создает описание тела запроса для OpenAPI спецификации
//   
// Параметры:
//  Схема - Структура - Схема тела запроса
//        - см. БлокСсылка
// 
// Возвращаемое значение:
//  Структура - Описание тела запроса:
// * description - Строка - Описание тела запроса
// * content - Соответствие из Структура - Содержимое запроса
// * required - Булево - Обязательность тела запроса
//
// Пример:
//   Схема = НоваяСхемаОбъекта("Данные пользователя");
//   Тело = БлокТелоЗапроса(Схема);
//
Функция БлокТелоЗапроса(Схема) Экспорт
	// https://spec.openapis.org/oas/v3.0.0.html#request-body-object
	
	Блок = Новый Структура();
	Блок.Вставить("description", "");
	Блок.Вставить("content", Новый Соответствие());
	Блок.Вставить("required", Истина);
	
	Блок.content.Вставить(РатОбщийКлиентСервер.ТипыСодержимого().JSON, Новый Структура("schema", Схема));
	
	Возврат Блок;
	
КонецФункции

// Создает описание тела ответа для OpenAPI спецификации
//   
// Параметры:
//  Схема - Структура, Строка - Схема тела ответа
//        - см. БлокСсылка
//  Описание - Строка, Неопределено - Описание тела ответа
// 
// Возвращаемое значение:
//  Структура - Описание тела ответа:
// * description - Строка, Неопределено - Описание тела ответа
// * content - Соответствие из Структура - Содержимое ответа
//
// Пример:
//   Схема = НоваяСхемаОбъекта("Данные пользователя");
//   Ответ = БлокТелоОтвета(Схема, "Успешный ответ");
//
Функция БлокТелоОтвета(Знач Схема, Описание = "") Экспорт
	// https://spec.openapis.org/oas/v3.0.0.html#responses-object
	
	Блок = Новый Структура();
	Блок.Вставить("description", Описание);
	Блок.Вставить("content", Новый Соответствие());
	
	Схема = НормализованнаяСхема(Схема);
	
	Блок.content.Вставить(РатОбщийКлиентСервер.ТипыСодержимого().JSON, Новый Структура("schema", Схема));
	
	Возврат Блок;
	
КонецФункции

#Область СхемыДанных

// Создает схему данных (JSON-schema) для OpenAPI спецификации
//   
// Параметры:
//  Тип - Строка - Тип данных
//  Описание - Строка, Неопределено - Описание схемы
// 
// Возвращаемое значение:
//  Структура - Схема данных:
// * type - Строка - Тип данных
// * description - Строка, Неопределено - Описание схемы
//
// Пример:
//   Схема = НоваяСхемаДанных("string", "Строковое значение");
//
Функция НоваяСхемаДанных(Тип, Описание = Неопределено) Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("type", Тип);
	
	Если Описание <> Неопределено Тогда
		Блок.Вставить("description", Описание);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Блок;
	
КонецФункции

// Создает схему объекта в формате JSON Schema
//   
// Параметры:
//  Описание - Строка, Неопределено - Описание объекта
// 
// Возвращаемое значение:
//  Структура - Схема объекта:
// * type - Строка - "object"
// * description - Строка, Неопределено - Описание объекта
// * properties - Структура - Свойства объекта
//
// Пример:
//   Схема = НоваяСхемаОбъекта("Данные пользователя");
//
Функция НоваяСхемаОбъекта(Описание = Неопределено) Экспорт

	Блок = НоваяСхемаДанных(ТипыДанных().Объект, Описание);
	Блок.Вставить("properties", Новый Структура());
	
	Возврат Блок;
	
КонецФункции

// Создает схему структуры для OpenAPI спецификации
//   
// Параметры:
//  Описание - Строка - Описание структуры
// 
// Возвращаемое значение:
//  Структура - Схема структуры:
// * type - Строка - "object"
// * description - Строка, Неопределено - Описание структуры
// * properties - Структура - Свойства объекта
// * additionalProperties - Структура - Схема дополнительных свойств
//
// Пример:
//   Схема = НоваяСхемаСтруктуры("Структура с дополнительными свойствами");
//
Функция НоваяСхемаСтруктуры(Описание) Экспорт
	
	Блок = НоваяСхемаОбъекта(Описание);
	Блок.Вставить("additionalProperties", Новый Структура());
	
	Возврат Блок;
	
КонецФункции

// Создает схему коллекции для OpenAPI спецификации
//   
// Параметры:
//  СхемаЭлементаКоллекции - Структура - Схема элемента коллекции
//                         - см. БлокСсылка
//  Описание - Строка, Неопределено - Описание коллекции
// 
// Возвращаемое значение:
//  Структура - Схема коллекции:
// * type - Строка - "array"
// * description - Строка, Неопределено - Описание коллекции
// * items - Структура - Схема элемента коллекции
//         - см. БлокСсылка
//
// Пример:
//   СхемаЭлемента = НоваяСхемаДанных("string");
//   Схема = НоваяСхемаКоллекции(СхемаЭлемента, "Массив строк");
//
Функция НоваяСхемаКоллекции(Знач СхемаЭлементаКоллекции, Описание = Неопределено) Экспорт
	
	ТипыДанных = ТипыДанных();
	
	Блок = НоваяСхемаДанных(ТипыДанных.Массив, Описание);
	
	СхемаЭлементаКоллекции = НормализованнаяСхема(СхемаЭлементаКоллекции);
	Блок.Вставить("items", СхемаЭлементаКоллекции);
	
	//@skip-check constructor-function-return-section
	Возврат Блок;
	
КонецФункции

// Создает схему перечисления для OpenAPI спецификации
//   
// Параметры:
//  Значения - Массив из Строка - Допустимые значения перечисления
//  Описание - Строка, Неопределено - Описание перечисления
// 
// Возвращаемое значение:
//  Структура - Схема перечисления:
// * type - Строка - "string"
// * description - Строка, Неопределено - Описание перечисления
// * enum - Массив из Строка - Допустимые значения
//
// Пример:
//   Значения = Новый Массив("active", "inactive", "blocked");
//   Схема = НоваяСхемаПеречисления(Значения, "Статус пользователя");
//
Функция НоваяСхемаПеречисления(Значения, Описание = Неопределено) Экспорт
	
	ТипыДанных = ТипыДанных();
	
	Блок = НоваяСхемаДанных(ТипыДанных.Перечисление, Описание);
	УстановитьДоступныеЗначения(Блок, Неопределено, Значения);
	
	//@skip-check constructor-function-return-section
	Возврат Блок;
	
КонецФункции

// Создает схему составного типа для OpenAPI спецификации
//   
// Параметры:
//  Схемы - Массив из Структура, Неопределено - Схемы составного типа
//        - Массив из см. БлокСсылка
//  Описание - Строка - Описание составного типа
// 
// Возвращаемое значение:
//  Структура - Схема составного типа:
// * oneOf - Массив из Структура - Схемы составного типа
//         - Массив из см. БлокСсылка
// * description - Строка - Описание составного типа
//
// Пример:
//   Схема1 = НоваяСхемаДанных("string");
//   Схема2 = НоваяСхемаДанных("number");
//   Схема = НоваяСхемаСоставногоТипа([Схема1, Схема2], "Строка или число");
//
Функция НоваяСхемаСоставногоТипа(Схемы = Неопределено, Описание = "") Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("oneOf", ?(Схемы = Неопределено, Новый Массив(), Схемы));
	Блок.Вставить("description", Описание);
	
	//@skip-check constructor-function-return-section
	Возврат Блок;
	
КонецФункции

// Создает схему объединения для OpenAPI спецификации
//   
// Параметры:
//  Описание - Строка - Описание объединения
//  Схема1 - Неопределено
//         - см. НоваяСхемаДанных
//         - см. СсылкаНаСхему
//  Схема2 - Неопределено
//         - см. НоваяСхемаДанных
//         - см. СсылкаНаСхему
//  Схема3 - Неопределено
//         - см. НоваяСхемаДанных
//         - см. СсылкаНаСхему
//  Схема4 - Неопределено
//         - см. НоваяСхемаДанных
//         - см. СсылкаНаСхему
// 
// Возвращаемое значение:
//  Структура - Схема объединения:
// * allOf - Массив из см. НоваяСхемаДанных - Схемы объединения
// * description - Строка - Описание объединения
//
// Пример:
//   Схема1 = НоваяСхемаДанных("object");
//   Схема2 = НоваяСхемаДанных("string");
//   Схема = НоваяСхемаОбъединения("Объект со строковым свойством", Схема1, Схема2);
//
Функция НоваяСхемаОбъединения(Описание, Схема1, Схема2 = Неопределено, Схема3 = Неопределено, Схема4 = Неопределено) Экспорт

	Блок = Новый Структура();
	
	Если ТипЗнч(Схема1) = Тип("Массив") Тогда
		Схемы = Схема1;
	Иначе
		Схемы = РатКоллекции.ЗначениеВМассиве(Схема1, Схема2, Схема3, Схема4);
	КонецЕсли;
	
	Блок.Вставить("allOf", Схемы);
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Блок.Вставить("description", Описание);
	КонецЕсли;
	
	Возврат Блок;

КонецФункции

// Добавляет реквизит в схему объекта OpenAPI
//   
// Параметры:
//  СхемаОбъекта - Структура - Схема объекта
//  ИмяСвойства - Строка - Имя добавляемого свойства
//  СхемаСвойства - см. НоваяСхемаОбъекта
//  ОписаниеСвойства - Строка, Неопределено - Описание свойства
// 
// Возвращаемое значение:
//  Структура - Схема добавленного свойства
//
// Пример:
//   Схема = НоваяСхемаОбъекта("Пользователь");
//   ДобавитьРеквизит(Схема, "name", НоваяСхемаДанных("string"), "Имя пользователя");
//
Функция ДобавитьРеквизит(СхемаОбъекта, ИмяСвойства, Знач СхемаСвойства, ОписаниеСвойства = Неопределено) Экспорт
	
	СхемаСвойства = НормализованнаяСхема(СхемаСвойства, ОписаниеСвойства);
	СхемаОбъекта.properties.Вставить(ИмяСвойства, СхемаСвойства);
	
	//@skip-check constructor-function-return-section
	Возврат СхемаСвойства;
	
КонецФункции

// Устанавливает список доступных значений для реквизита
// 
// Параметры:
//  Схема - Структура - Схема объекта или схема реквизита
//  ИмяРеквизита - Строка, Неопределено - Имя реквизита объекта, если не указано, считаем, что передана схема реквизита
//  Значения - Массив из Строка - Список доступных значений
//
// Пример:
//   Схема = НоваяСхемаОбъекта("Пользователь");
//   ДобавитьРеквизит(Схема, "status", НоваяСхемаДанных("string"), "Статус пользователя");
//   УстановитьДоступныеЗначения(Схема, "status", ["active", "inactive", "blocked"]);
//
Процедура УстановитьДоступныеЗначения(Схема, ИмяРеквизита, Значения) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяРеквизита) Тогда
		Схема.Вставить("enum", Значения);
	Иначе
		Схема.properties[ИмяРеквизита].Вставить("enum", Значения);
	КонецЕсли;
	
КонецПроцедуры

// Нормализует схему для использования в OpenAPI спецификации
//
// Особенности работы:
// * Если передан не строковый тип, возвращает схему без изменений
// * Если строка начинается с "#/", создает ссылку на компонент через см. БлокСсылка
// * В остальных случаях создает новую схему данных через см. НоваяСхемаДанных
// * Используется для унификации представления схем в OpenAPI спецификации
//   
// Параметры:
//  Схема - Структура, Строка - Исходная схема
//        - см. БлокСсылка
//  Описание - Строка, Неопределено - Описание схемы
// 
// Возвращаемое значение:
// - Структура
// - см. РатOpenAPI.БлокСсылка
// - см. РатOpenAPI.НоваяСхемаДанных
//  
// Пример:
//   Схема = НормализованнаяСхема("string", "Описание строки");
//   // Результат: { "type": "string", "description": "Описание строки" }
//
//   Схема = НормализованнаяСхема("#/components/schemas/User");
//   // Результат: { "$ref": "#/components/schemas/User" }
//
Функция НормализованнаяСхема(Знач Схема, Описание = Неопределено) Экспорт
	
	Если ТипЗнч(Схема) <> Тип("Строка") Тогда
		Возврат Схема;
	КонецЕсли;
	
	Если СтрНачинаетсяС(Схема, "#/") Тогда
		Схема = БлокСсылка(Схема);
	Иначе
		Схема = НоваяСхемаДанных(Схема, Описание);
	КонецЕсли;
	
	//@skip-check constructor-function-return-section
	Возврат Схема;
	
КонецФункции

// Создает ссылку на схему-компонент в OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя схемы
// 
// Возвращаемое значение:
//  см. БлокСсылка
//
// Пример:
//   Ссылка = СсылкаНаСхему("User");
//   // Результат: { "$ref": "#/components/schemas/User" }
//
Функция СсылкаНаСхему(Имя) Экспорт

	Возврат БлокСсылка("#/components/schemas/" + Имя);

КонецФункции

// Создает ссылку на параметр-компонент в OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя параметра
// 
// Возвращаемое значение:
//  см. БлокСсылка
//
// Пример:
//   Ссылка = СсылкаНаПараметр("userId");
//   // Результат: { "$ref": "#/components/parameters/userId" }
//
Функция СсылкаНаПараметр(Имя) Экспорт

	Возврат БлокСсылка("#/components/parameters/" + Имя);

КонецФункции

// Создает ссылку на описания тела ответа в OpenAPI спецификации
//   
// Параметры:
//  Имя - Строка - Имя параметра
// 
// Возвращаемое значение:
//  см. БлокСсылка
//
// Пример:
//   Ссылка = СсылкаНаТелоОтвета("error");
//   // Результат: { "$ref": "#/components/responses/error" }
//
Функция СсылкаНаТелоОтвета(Имя) Экспорт

	Возврат БлокСсылка("#/components/responses/" + Имя);

КонецФункции

#КонецОбласти

// Создает описание базовой HTTP аутентификации для OpenAPI спецификации
// 
// Возвращаемое значение:
//  Структура - Описание схемы безопасности:
// * type - Строка - "http"
// * description - Строка - Описание схемы
//               - Неопределено
// * scheme - Строка - "basic"
//
// Пример:
//   Схема = НастройкаБазовойАутентификации();
//   // Результат: { "type": "http", "description": "Базовая схема авторизации", "scheme": "basic" }
//
Функция НастройкаБазовойАутентификации() Экспорт
	// https://developer.mozilla.org/ru/docs/Web/HTTP/Authentication#basic_authentication_scheme
	
	Блок = БлокСхемаБезопасности(ТипыСхемыБезопасности().http, "Базовая схема авторизации");
	Блок.Вставить("scheme", "basic");
	
	Возврат Блок;
	
КонецФункции

// Создает схему безопасности для OpenAPI спецификации
//   
// Параметры:
//  Тип - Строка - Тип схемы безопасности
//  Описание - Строка, Неопределено - Описание схемы безопасности
// 
// Возвращаемое значение:
//  Структура - Схема безопасности:
// * type - Строка - Тип схемы безопасности
// * description - Строка - Описание схемы безопасности
//               - Неопределено
//
// Пример:
//   Схема = БлокСхемаБезопасности("http", "HTTP схема авторизации");
//
Функция БлокСхемаБезопасности(Тип, Описание = Неопределено) Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("type", Тип);
	
	Если Описание <> Неопределено Тогда
		Блок.Вставить("description", Описание);
	КонецЕсли;
	
	Возврат Блок;
	
КонецФункции

#Область Перечисления

// Возвращает перечисление возможных положений параметра в OpenAPI спецификации
//   
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Положения параметра:
// * Путь - Строка - "path"
// * Заголовок - Строка - "header"
// * Параметры - Строка - "query"
// * Куки - Строка - "cookie"
//
// Пример:
//   Положения = ПоложениеПараметра();
//
Функция ПоложениеПараметра() Экспорт
	
	Значения = Новый Структура();
	Значения.Вставить("Путь", "path");
	Значения.Вставить("Заголовок", "header");
	Значения.Вставить("Параметры", "query");
	Значения.Вставить("Куки", "cookie");
	
	Возврат Новый ФиксированнаяСтруктура(Значения);
	
КонецФункции

// Возвращает перечисление типов схем безопасности в OpenAPI спецификации
//   
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Типы схем безопасности:
// * http - Строка - "http"
// * apiKey - Строка - "apiKey"
// * oauth2 - Строка - "oauth2"
// * openIdConnect - Строка - "openIdConnect"
//
// Пример:
//   Типы = ТипыСхемыБезопасности();
//
Функция ТипыСхемыБезопасности() Экспорт
	
	Типы = Новый Структура;
	Типы.Вставить("http", "http");
	Типы.Вставить("apiKey", "apiKey");
	Типы.Вставить("oauth2", "oauth2");
	Типы.Вставить("openIdConnect", "openIdConnect");
	
	Возврат Новый ФиксированнаяСтруктура(Типы);
	
КонецФункции

// Возвращает перечисление типов данных в OpenAPI спецификации
//   
// Возвращаемое значение:
//  ФиксированнаяСтруктура - Типы данных:
// * ЦелоеЧисло - Строка - "integer"
// * ДробноеЧисло - Строка - "number"
// * Строка - Строка - "string"
// * Булево - Строка - "boolean"
// * Дата - Строка - "string"
// * Объект - Строка - "object"
// * Массив - Строка - "array"
// * Перечисление - Строка - "string"
//
// Пример:
//   Типы = ТипыДанных();
//
Функция ТипыДанных() Экспорт
	
	ТипСтрока = "string";
	
	ТипыДанных = Новый Структура();
	ТипыДанных.Вставить("ЦелоеЧисло", "integer");
	ТипыДанных.Вставить("ДробноеЧисло", "number");
	ТипыДанных.Вставить("Строка", ТипСтрока);
	ТипыДанных.Вставить("Булево", "boolean");
	ТипыДанных.Вставить("Дата", ТипСтрока);
	ТипыДанных.Вставить("Объект", "object");
	ТипыДанных.Вставить("Массив", "array");
	ТипыДанных.Вставить("Перечисление", ТипСтрока);
	
	Возврат Новый ФиксированнаяСтруктура(ТипыДанных);

КонецФункции

#КонецОбласти

// Создает блок информации о сервисе для OpenAPI спецификации
//   
// Возвращаемое значение:
//  Структура - Информация о сервисе:
// * title - Строка, Неопределено - Название сервиса
// * description - Строка, Неопределено - Описание сервиса
// * termsOfService - Строка - Условия использования сервиса
// * version - Строка - Версия сервиса
//
// Пример:
//   Информация = БлокИнформацияОСервисе();
//   Информация.title = "МойСервис";
//   Информация.description = "Описание моего сервиса";
//
Функция БлокИнформацияОСервисе() Экспорт
	
	Блок = Новый Структура();
	Блок.Вставить("title", Неопределено);
	Блок.Вставить("description", Неопределено);
	Блок.Вставить("termsOfService", "");
	Блок.Вставить("version", Метаданные.Версия);
	
	Возврат Блок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает блок компонентов для OpenAPI спецификации
//   
// Возвращаемое значение:
//  Структура - Блок компонентов:
// * schemas - Соответствие из Структура - Схемы данных
// * responses - Соответствие из Структура - Описания ответов
// * parameters - Соответствие из Структура - Параметры
// * examples - Соответствие из Структура - Примеры
// * requestBodies - Соответствие из Структура - Тела запросов
// * headers - Соответствие из Структура - Заголовки
// * securitySchemes - Соответствие из Структура - Схемы безопасности
// * links - Соответствие из Структура - Ссылки
// * callbacks - Соответствие из Структура - Обратные вызовы
//
// Пример:
//   Компоненты = БлокКомпоненты();
//   // Результат: { "schemas": {}, "responses": {}, "parameters": {}, "examples": {}, 
//   //             "requestBodies": {}, "headers": {}, "securitySchemes": {}, 
//   //             "links": {}, "callbacks": {} }
//
Функция БлокКомпоненты()
	
	Блок = Новый Структура();
	Блок.Вставить("schemas", Новый Соответствие());
	Блок.Вставить("responses", Новый Соответствие());
	Блок.Вставить("parameters", Новый Соответствие());
	Блок.Вставить("examples", Новый Соответствие());
	Блок.Вставить("requestBodies", Новый Соответствие());
	Блок.Вставить("headers", Новый Соответствие());
	Блок.Вставить("securitySchemes", Новый Соответствие());
	Блок.Вставить("links", Новый Соответствие());
	Блок.Вставить("callbacks", Новый Соответствие());
	
	Возврат Блок;
	
КонецФункции

#КонецОбласти
