//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции().УдалениеТестовыхДанных()
		.ДобавитьТест("СтруктураДанных")
		.ДобавитьТест("СтруктураДанных_ПримитивныеТипы")
		.ДобавитьТест("МассивСтруктур")
		.ДобавитьТест("СтруктураПоиска")
		.ДобавитьТест("ПростойМассивЗначений")
	;
	
КонецПроцедуры

Процедура СтруктураДанных() Экспорт
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 | Кол2 | Кол3 |
	|| ---- | ---- | ---- |
	|| Число | 99 | Число |
	|| Строка | 1,2,3 | Строка |
	|| НетТипа | 1;2 ; 3 | |");
	
	Результат = РатШагиВанессыКлиент.СтруктураДанных(Данные, Истина);
	
	ЮТест.ОжидаетЧто(Результат, "СтруктураДанных")
		.ИмеетТип("Структура")
		.Свойство("Число")
			.Равно(99)
		.Свойство("Строка")
			.ИмеетТип("Структура")
			.Свойство("Строка.value").Равно("1,2,3")
		.Свойство("НетТипа")
			.ИмеетТип("Строка")
			.Равно("1;2 ; 3")
	
КонецПроцедуры

Процедура СтруктураДанных_ПримитивныеТипы() Экспорт
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 | Кол2 | Кол3 |
	|| ---- | ---- | ---- |
	|| Число | 11 | Число |
	|| Число2 | 11.5 | Число |
	|| Строка | 1,2,3 | Строка |
	|| Булево | Истина | boolean |
	|| Булево2 | false | boolean |");
	
	Результат = РатШагиВанессыКлиент.СтруктураДанных(Данные, Истина);
	
	ЮТест.ОжидаетЧто(Результат, "СтруктураДанных")
		.ИмеетТип("Структура")
		.Свойство("Число").Равно(11)
		.Свойство("Число2").Равно(11.5)
		.Свойство("Строка")
			.ИмеетТип("Структура")
			.Свойство("Строка.type").Равно("Строка")
			.Свойство("Строка.value").Равно("1,2,3")
		.Свойство("Булево").Равно(Истина)
		.Свойство("Булево2").Равно(Ложь)
	;
	
КонецПроцедуры

Процедура МассивСтруктур() Экспорт
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 | Кол2 | Кол3 |
	|| ---- | ---- | ---- |
	|| Ключ | Значение | Тип |
	|| Число | 1; 2 ; 3 | Число |
	|| Строка | 1,2,3 | Строка |");
	
	Результат = РатШагиВанессыКлиент.МассивСтруктур(Данные);
	
	ЮТест.ОжидаетЧто(Результат, "МассивСтруктур")
		.ИмеетТип("Массив")
		.ИмеетДлину(2)
		.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
			.ИмеетТип("Структура")
			.ИмеетСвойство("Ключ")
			.ИмеетСвойство("Значение")
			.ИмеетСвойство("Тип"))
		.Свойство("[0].Значение").Равно("1; 2 ; 3")
		.Свойство("[1].Значение").Равно("1,2,3")
	;
	
КонецПроцедуры

Процедура СтруктураПоиска() Экспорт
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 | Кол2 | Кол3 |
	|| ---- | ---- | ---- |
	|| Реквизит        | Значение  | Условие |
	|| Ссылка          | Документы | ВГруппе |
	|| ПометкаУдаления | Истина    | НеРавно |
	|| Идентификатор   | ЗаявкаНаЧекКоррекции;ЧекККМ | НеВСписке |
	|| Тип             | Вид       | Равно   |
	|");
	
	Результат = РатШагиВанессыКлиент.СтруктураПоиска(Данные);
	
	ЮТест.ОжидаетЧто(Результат, "Структура поиска расширенная")
		.ИмеетТип("Структура")
		.Свойство("filter")
			.ИмеетТип("Массив")
			.ИмеетДлину(4)
			.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
				.ИмеетТип("Структура")
				.ИмеетСвойство("key")
				.ИмеетСвойство("value")
				.ИмеетСвойство("condition"))
		.Свойство("filter[2].value").Равно(ЮТОбщий.ЗначениеВМассиве("ЗаявкаНаЧекКоррекции", "ЧекККМ"))
	;
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 | Кол2 |
	|| ---- | ---- |
	|| Идентификатор   | ЗаявкаНаЧекКоррекции;ЧекККМ |
	|| Тип             | Вид       |
	|");
	
	Результат = РатШагиВанессыКлиент.СтруктураПоиска(Данные);
	
	ЮТест.ОжидаетЧто(Результат, "Структура поиска простая")
		.ИмеетТип("Структура")
		.Свойство("filter")
			.ИмеетТип("Структура")
			.ИмеетДлину(2)
		.Свойство("filter.Идентификатор").Равно("ЗаявкаНаЧекКоррекции;ЧекККМ")
	;
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Реквизит | Значение | Условие |
	|| ---- | ---- | ---- |
	|| Ссылка          | Документы | ВГруппе |
	|| ПометкаУдаления | Истина    | НеРавно |
	|| Идентификатор   | ЗаявкаНаЧекКоррекции;ЧекККМ | НеВСписке |
	|| Тип             | Вид       | Равно   |
	|");
	
	Результат = РатШагиВанессыКлиент.СтруктураПоиска(Данные);
	
	ЮТест.ОжидаетЧто(Результат, "Структура поиска расширенная")
		.ИмеетТип("Структура")
		.Свойство("filter")
			.ИмеетТип("Массив")
			.ИмеетДлину(4)
			.КаждыйЭлементСоответствуетПредикату(ЮТест.Предикат()
				.ИмеетТип("Структура")
				.ИмеетСвойство("key")
				.ИмеетСвойство("value")
				.ИмеетСвойство("condition"))
		.Свойство("filter[2].value").Равно(ЮТОбщий.ЗначениеВМассиве("ЗаявкаНаЧекКоррекции", "ЧекККМ"))
	;
КонецПроцедуры

Процедура ПростойМассивЗначений() Экспорт
	
	Данные = ЮТест.Данные().ТаблицаMarkDown(
	"| Кол1 |
	|| ---- |
	|| 1 |
	|| 2 |
	|| 3 |");
	
	Значене = РатШагиВанессыКлиент.ПростойМассивЗначений(Данные);
	ЮТест.ОжидаетЧто(Значене, "Из таблицы геркен").Равно(СтрРазделить("1,2,3", ","));
	
	Значене = РатШагиВанессыКлиент.ПростойМассивЗначений("1;2;3");
	ЮТест.ОжидаетЧто(Значене, "Из строки").Равно(СтрРазделить("1,2,3", ","));
	
	Значене = РатШагиВанессыКлиент.ПростойМассивЗначений("");
	ЮТест.ОжидаетЧто(Значене, "Пустой массив").Равно(Новый Массив());
	
КонецПроцедуры

#КонецОбласти
