//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ОпределитьШаблон")
		.ДобавитьТест("ПараметрыURL")
		.ДобавитьТест("ЗарегистрироватьШаблоны")
			.СПараметрами("РатВиртуальныеТаблицы")
			.СПараметрами("РатВыполнениеПроизвольныхЗапросов")
			.СПараметрами("РатДвижения")
			.СПараметрами("РатИнформационнаяБазаСервис")
			.СПараметрами("РатОбмены")
			.СПараметрами("РатПользователиИнформационнойБазы")
			.СПараметрами("РатРегламентныеЗадания")
			.СПараметрами("РатТабличныеЧасти")
	;
	
КонецПроцедуры

Процедура ОпределитьШаблон() Экспорт
	
	Варианты = Новый Массив;
	Ключи = "Метод, URL, Ожидание";
	
	Варианты.Добавить(Новый Структура(Ключи, "GET", "Справочники/Пользователи", "СписокДанныхТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "POST", "Справочники/Пользователи/Поиск", "СписокДанныхТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "get", "/Справочники/Пользователи/a772d037-9519-4c2b-8c9b-ad9de187fe90", "ПолучитьЗаписьТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "GET", "/Справочники/Пользователи/a772d037-9519-4c2b-8c9b-ad9de187fe90", "ПолучитьЗаписьТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "POST", "Справочники/Пользователи", "СоздатьЗаписьТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "POST", "Справочники/Пользователи/Поиск", "СписокДанныхТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "put", "/Справочники/Пользователи/a772d037-9519-4c2b-8c9b-ad9de187fe90", "ИзменитьЗаписьТаблицы"));
	Варианты.Добавить(Новый Структура(Ключи, "DELETE", "Справочники/Пользователи/a772d037-9519-4c2b-8c9b-ad9de187fe90", "УдалитьЗаписьТаблицы"));
	
	Варианты.Добавить(Новый Структура(Ключи, "GET", "РегламентныеЗадания", "СписокРегламентныхЗаданий"));
	Варианты.Добавить(Новый Структура(Ключи, "GET", "РегламентныеЗадания/ВыгрузкиДанных", "ДанныеРегламентногоЗадания"));
	Варианты.Добавить(Новый Структура(Ключи, "post", "РегламентныеЗадания/ВыгрузкиДанных/Запустить", "ЗапуститьРегламентноеЗадание"));
	
	Для Каждого Вариант Из Варианты Цикл
		
		СтатусОбработкиЗапроса = ПомощникТестированияРат.Статус();
		Шаблон = РатШаблоныАдресов.ОпределитьШаблон(Вариант.Метод, Вариант.URL, СтатусОбработкиЗапроса);
		
		Описание = СтрШаблон("[%1] /%2", Вариант.Метод, Вариант.URL);
		ЮТест.ОжидаетЧто(Шаблон, "Обработчик для " + Описание)
			.Заполнено("не нашли обработчик")
			.Свойство("Обработчик").Равно(Вариант.Ожидание, "неверный обработчик");
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПараметрыURL() Экспорт
	
	Шаблон = Новый Структура("Блоки, Обработчик", СтрРазделить("{Тип}/{Вид}", "/"), "Тест");
	
	Варианты = Новый Массив();
	Варианты.Добавить(Новый Структура("Текст, Тип, Вид", "Справочники/Пользователи", "Справочники", "Пользователи")); 
	Варианты.Добавить(Новый Структура("Текст, Тип, Вид", "/Справочники/Пользователи", "Справочники", "Пользователи")); 
	Варианты.Добавить(Новый Структура("Текст, Тип, Вид", "/Справочники/Пользователи/", "Справочники", "Пользователи")); 
	Варианты.Добавить(Новый Структура("Текст, Тип, Вид", "Справочники/Пользователи/", "Справочники", "Пользователи")); 
	
	Для Каждого Вариант Из Варианты Цикл
		Результат = РатШаблоныАдресов.ПараметрыURL(Шаблон, Вариант.Текст);
		ТестированиеСервер.ОбъектыРавны(Результат, Вариант, "Тип, Вид", "Не верный результат для адреса " + Вариант.Текст);
	КонецЦикла;
	
	Варианты = Новый Массив();
	Варианты.Добавить(Новый Структура("Шаблон, Текст, Ожидание", "{Тип}/{Вид}", "С/П", Новый Структура("Тип, Вид", "С", "П"))); 
	Варианты.Добавить(Новый Структура("Шаблон, Текст, Ожидание", "Справочники/{Вид}", "Справочники/П1", Новый Структура("Вид", "П1"))); 
	Варианты.Добавить(Новый Структура("Шаблон, Текст, Ожидание", "Справочники/Вид", "Справочники/П1", Новый Структура())); 
	Варианты.Добавить(Новый Структура("Шаблон, Текст, Ожидание", "{Вид}/Поиск/{Усл}", "П1/Поиск/П2", Новый Структура("Вид, Усл", "П1", "П2"))); 
	Варианты.Добавить(Новый Структура("Шаблон, Текст, Ожидание", "{Вид/Поиск/{Условие}", "П1/Поиск/П2", Новый Структура("Условие", "П2")));
	
	Для Каждого Вариант Из Варианты Цикл
		Шаблон = Новый Структура("Блоки, Обработчик", СтрРазделить(Вариант.Шаблон, "/"), "Тест");
		Результат = РатШаблоныАдресов.ПараметрыURL(Шаблон, Вариант.Текст);
		
		ТестированиеСервер.ОбъектыРавны( Результат, Вариант.Ожидание, , "Не верный результат для адреса " + Вариант.Текст);
		ЮТест.ОжидаетЧто(Результат, Вариант.Текст)
			.ИмеетДлину(Вариант.Ожидание.Количество(), "не совпадает количество элементов");
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗарегистрироватьШаблоны(ИмяМодуля) Экспорт
	
	Модуль = Вычислить(ИмяМодуля);
	
	Шаблоны = Новый ТаблицаЗначений();
	Шаблоны.Колонки.Добавить("Метод", Новый ОписаниеТипов("Строка"));
	Шаблоны.Колонки.Добавить("Шаблон", Новый ОписаниеТипов("Строка"));
	Шаблоны.Колонки.Добавить("Обработчик", Новый ОписаниеТипов("Строка"));
	Шаблоны.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	Шаблоны.Колонки.Добавить("Блоки", Новый ОписаниеТипов("Массив"));
	Шаблоны.Колонки.Добавить("Ограничения", Новый ОписаниеТипов("Структура"));
	
	Модуль.ЗарегистрироватьШаблоны(Шаблоны);
	
	ЮТест.ОжидаетЧто(Шаблоны)
		.Заполнено();
	
КонецПроцедуры

#КонецОбласти
