//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Эмулировать нажатие сочетания клавиш на клиенте тестирования
// Поддерживаемые сочетания см. ИменованныеСочетанияКлавиш
// 
// Параметры:
//  Ванесса - Произвольный - контекст фреймворка Vanessa-Automation
//  Сочетание - см. НовоеСочетаниеКлавиш
Процедура ЭмулироватьНажатиеСочетанияКлавиш(Ванесса, Сочетание) Экспорт
	
	Команда  = РатВзаимодействиеСКлиентомТестирования.НоваяКоманда();
	
	// см. РатЭмуляцияДействийПользователяВызовКлиента.ЭмулироватьНажатиеСочетанияКлавиш
	Команда.Метод = "РатЭмуляцияДействийПользователяВызовКлиента.ЭмулироватьНажатиеСочетанияКлавиш";
	Команда.Параметры.Добавить(Сочетание);
	
	РатВзаимодействиеСКлиентомТестирования.ВыполнитьКоманду(Ванесса, Команда);
	
КонецПроцедуры

// Возвращает именованные сочетания клавиш для эмуляции действий пользователя
// 
// Возвращаемое значение:
//  Структура - Именованные сочетания клавиш:
// * ВызовКонтекстногоМеню - Структура - сочетание клавиш, эмулирующее вызов контекстного меню (SHIFT+F10)
// * Ввод - Структура - сочетание клавиш, эмулирующее ввод (нажатие Enter)
Функция ИменованныеСочетанияКлавиш() Экспорт
	
	Результат = Новый Структура;
	
	ДобавитьИменованноеСочетаниеКлавиш(Результат, "ВызовКонтекстногоМеню", "+{F10}");
	ДобавитьИменованноеСочетаниеКлавиш(Результат, "Ввод", "ENTER");
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создает новое описание сочетания клавиш
// 
// Параметры:
//  Имя - Строка - имя сочетания клавиш
// 
// Возвращаемое значение:
//  Структура - Новое описание сочетания клавиш:
// * Имя - Строка - имя сочетания клавиш
// * WScriptShell - Строка - строка для отправки в WScript.Shell
Функция НовоеСочетаниеКлавиш(Имя)
	
	Результат = Новый Структура;
	Результат.Вставить("Имя", Имя);
	Результат.Вставить("WScriptShell", "");
	
	Возврат Результат;

КонецФункции

// Добавляет именованное сочетание клавиш в коллекцию
// 
// Параметры:
//  Приемник - Структура - коллекция для добавления сочетания клавиш
//  Имя - Строка - имя сочетания клавиш
//  КодWScriptShell - Строка - код сочетания клавиш для WScript.Shell
Процедура ДобавитьИменованноеСочетаниеКлавиш(Приемник, Имя, КодWScriptShell)
	
	Результат = НовоеСочетаниеКлавиш(Имя);
	Результат.WScriptShell = КодWScriptShell;
	
	Приемник.Вставить(Имя, Результат);
		
КонецПроцедуры

#КонецОбласти
