#language: ru
@Tree

Функционал: Движения документа

Контекст:

	Дано выполнена настройка подключения

Сценарий: Движения документа

	Дано я создаю запись "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST"
		| Наименование | "Тестовый товар" |
	И я сохраняю в переменную "Номенклатура" реквизит результата запроса "id"
	И я создаю запись "Справочник.ПУБ_Склады" внешней системы "RAT_REST"
		| Наименование | "Тестовый склад" |
	И я сохраняю в переменную "Склад" реквизит результата запроса "id"
	И я создаю запись "Документ.ПУБ_Чек" внешней системы "RAT_REST"
		| НомерСмены | 1 |
		| ВидОперации | Приход |
		| КассоваяСмена | 1 |
	И я сохраняю в переменную "Чек" реквизит результата запроса "id"
	Когда я получаю движения документа "ПУБ_Чек.$Чек$" по регистру "ПУБ_ОстаткиТоваров" внешней системы "RAT_REST"
	Тогда Количество элементов результата запроса равно "0"
	Когда Я изменяю движения документа "ПУБ_Чек.$Чек$" по регистру "ПУБ_ОстаткиТоваров" внешней системы "RAT_REST"
	| Регистратор | Склад | Номенклатура | Количество | Сумма |
	| $Чек$       | $Склад$ | $Номенклатура$ | 10        | 1000  |
	И я получаю движения документа "ПУБ_Чек.$Чек$" по регистру "ПУБ_ОстаткиТоваров" внешней системы "RAT_REST"
	Тогда Количество элементов результата запроса равно "1"
	И реквизит результата запроса "[0].Количество" равен "{10}"
	И реквизит результата запроса "[0].Сумма" равен "{1000}"
