#language: ru
@tree

Функционал: Проверка работы с базой БСП

Контекст:

	Дано выполнена настройка подключения

Сценарий: Работа со справочниками

	Дано Я запоминаю значение выражения '"Номенклатура" + Строка(Новый УникальныйИдентификатор)' в переменную "УникальноеИмяНоменклатуры"
	И Я создаю запись "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST"
		| Наименование       | $УникальноеИмяНоменклатуры$ |
		| Код | ТЕСТ001 |
	И Я сохраняю в переменную "НоваяНоменклатура" реквизит результата запроса "presentation"
	И Я создаю структуру "Отбор"
		| 'Наименование' | '$НоваяНоменклатура$' |
	И Я изменяю записи "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST" соответствующие отбору "$Отбор$" установив
		| 'Код' | 'ТЕСТ002' |
	И Я получаю запись "Справочник.ПУБ_Номенклатура.$НоваяНоменклатура$" внешней системы "RAT_REST"
	И реквизит результата запроса "Наименование" равен "$УникальноеИмяНоменклатуры$"
	И реквизит результата запроса "Код" равен "ТЕСТ002"
