#language: ru
@Tree

Функционал: Работа с планами обмена

	Как тестировщик
	Я хочу, чтобы была возможность настраивать планы обмена и работать с зарегистрированными изменениями

Контекст:

	Дано выполнена настройка подключения

Сценарий: Регистрация изменений объекта

	Дано Я запоминаю значение выражения '"Обмен" + Формат(ТекущаяДата(), "ДФ=ММ-дд-ЧЧ-мм")' в переменную "ИмяУзла"
	Тогда Я создаю запись "ПланОбмена.ПУБ_Все" внешней системы "RAT_REST"
		| Наименование | $ИмяУзла$ |
	И Я изменяю запись "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
		| Наименование | $ИмяУзла$ |
	Когда Я запоминаю значение выражения '"Номенклатура" + Формат(ТекущаяДата(), "ДФ=ММ-дд-ЧЧ-мм")' в переменную "ИмяОбъекта"
	И Я создаю запись "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST"
		| Наименование | $ИмяОбъекта$ |
	И объект "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" не зарегистрирован на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	И я регистрирую изменение "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	Тогда объект "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" зарегистрирован на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	И я регистрирую изменение "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	
	Тогда я удаляю регистрацию изменений "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	И объект "Справочник.ПУБ_Номенклатура.$ИмяОбъекта$" не зарегистрирован на узле "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
	И Я удаляю запись "ПланОбмена.ПУБ_Все.$ИмяУзла$" внешней системы "RAT_REST"
