#language: ru
@Tree

Функционал: Создание пользователей ИБ

	Как тестировщик
	Я хочу, чтобы была возможность создавать пользователей информационной системе через REST API

Контекст:

	Дано выполнена настройка подключения

Сценарий: Создание пользователя

	Дано Я запоминаю значение выражения '"ТестовыйПользователь" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "")' в переменную "ИмяПользователя"
	Когда Я создаю пользователя внешней системы "RAT_REST"
	| Имя                       | $ИмяПользователя$                             |
	| Пароль                    | 123                                           |
	| ЗащитаОтОпасныхДействий   | Ложь                                          |
	| АутентификацияСтандартная | Истина                                        |
	| АутентификацияОС          | Ложь                                          |
	| ПоказыватьВСпискеВыбора   | Ложь                                          |
	| Роли                      | Пользователь, ИмяПользователя, Технический отдел|
	Тогда существует пользователь "$ИмяПользователя$" внешней системы "RAT_REST"

	Когда Я получаю данные пользователя "$ИмяПользователя$" внешней системы "RAT_REST"
	Тогда реквизит результата запроса "Имя" равен "$ИмяПользователя$"

Сценарий: Изменение пользователя

	Дано Я запоминаю значение выражения '"ТестовыйПользователь" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "")' в переменную "ИмяПользователя"
	И Я создаю пользователя внешней системы "RAT_REST"
	| Имя                       | $ИмяПользователя$               |
	| Роли                      | Пользователь, Технический отдел |
	Когда Я Изменяю пользователя "$ИмяПользователя$" внешней системы "RAT_REST"
	| Роли                      | Пользователь, ИмяПользователя |
	| ПолноеИмя                 | Пользователь из сценария    |
	Тогда Я получаю данные пользователя "$ИмяПользователя$" внешней системы "RAT_REST"
	И реквизит результата запроса "Роли[0]" равен "Пользователь"
	И реквизит результата запроса "Роли[1]" равен "ИмяПользователя" 
	И реквизит результата запроса "ПолноеИмя" равен "Пользователь из сценария" 

Сценарий: Проверка существования пользователя

	Если существует пользователь "remote_user" внешней системы "RAT_REST" Тогда
		Тогда реквизит результата запроса "Имя" равен "remote_user"
	Если не существует пользователь "remote_user" внешней системы "RAT_REST" Тогда
		Тогда Я создаю пользователя внешней системы "RAT_REST"
			| Имя    | remote_user                                   |
			| Пароль |                                               |
			| Роли   | Пользователь; ИмяПользователя, Технический отдел|
	Тогда существует пользователь "remote_user" внешней системы "RAT_REST"
	И реквизит результата запроса "Роли[0]" равен "ИмяПользователя"
	И реквизит результата запроса "Роли[1]" равен "Пользователь" 
	И реквизит результата запроса "Роли[2]" равен "ТехническийОтдел"
