#language: ru
@Tree

Функционал: Работа с регламентными заданиями

	Как тестировщик
	Я хочу, чтобы была возможность управлять регламентными заданиями информационной системе через REST API

Контекст:

	Дано выполнена настройка подключения

Сценарий: Запуск регламентного задания

	Дано Я устанавливаю максимальное время ожидания завершения регламентного задания "10 минут"
	Когда Я запускаю регламентное задание "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	Когда Я запускаю регламентное задание "ПроизвольныйАлгоритм" внешней системы "RAT_REST" и ожидаю завершения
	Дано Я устанавливаю максимальное время ожидания завершения регламентного задания "секунда"
	Когда Я запускаю регламентное задание "ПроизвольныйАлгоритм" внешней системы "RAT_REST" и ожидаю завершения

Сценарий: Включение регламентного задания

	Когда Я включаю регламентное задание "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	Тогда Я получаю параметры регламентного задания "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	И реквизит результата запроса "Использование" равен "Истина"
	
	Когда Я выключаю регламентное задание "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	Тогда Я получаю параметры регламентного задания "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	И реквизит результата запроса "Использование" равен "Ложь"

	Когда Я выключаю все регламентные задания внешней системы "RAT_REST"
	Тогда Я получаю параметры регламентного задания "ПроизвольныйАлгоритм" внешней системы "RAT_REST"
	И реквизит результата запроса "Использование" равен "Ложь"
