#language: ru
@tree

Функционал: Фильтрация данных

Контекст:

	Дано выполнена настройка подключения

Сценарий: Поиск по табличной части

	Когда Я ищу записи "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST" по условиям
		| Реквизит                            | Значение       |
		| Наименование                        | ТестТовар      |
	Тогда количество элементов результата запроса равно "0"

Сценарий: Различные условия поиска

	Когда Я ищу записи "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST" по условиям
		| Реквизит          | Значение  | Условие |
		| Тип               | Справочник | Равно |
		| ПометкаУдаления   | Истина    | НеРавно |

	Когда Я ищу записи "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST" по условиям
		| Реквизит          | Значение  | Условие |
		| Тип               | Справочник | Равно |
		| ПометкаУдаления   | Истина    | НеРавно |
		| Наименование      | ПУБ_Номенклатура | ВСписке |

	Когда Я ищу записи "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST" по условиям
		| Реквизит          | Значение  | Условие |
		| Тип               | Справочник | Равно |
		| ПометкаУдаления   | Истина    | НеРавно |
		| Наименование      | ПУБ_Номенклатура;ПУБ_Склады | НеВСписке |

	Когда Я ищу записи "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST" по условиям
		| Реквизит        | Значение  | Условие |
		| Тип             | Справочник | Равно |
		| ПометкаУдаления | Ложь      | Равно |
		| Наименование    | ПУБ_Номенклатура;ПУБ_Склады | ВСписке |

	Тогда Я создаю таблицу данных "Отбор"
		| Реквизит        | Значение  | Условие |
		| Тип             | Справочник | Равно |
		| ПометкаУдаления | Ложь      | Равно |
		| Наименование    | ПУБ_Номенклатура;ПУБ_Склады | ВСписке |
	Когда Я ищу записи "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST" по условиям "$Отбор$"
