//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ЗарегистрироватьОписание")
			.СПараметрами("РатВиртуальныеТаблицы")
			.СПараметрами("РатВыполнениеПроизвольныхЗапросов")
			.СПараметрами("РатДвижения",  Ложь)
			.СПараметрами("РатИнформационнаяБазаСервис")
			.СПараметрами("РатОбмены")
			.СПараметрами("РатПользователиИнформационнойБазы")
			.СПараметрами("РатРегламентныеЗадания")
			.СПараметрами("РатТабличныеЧасти", Ложь)
	;
	
КонецПроцедуры

Процедура ЗарегистрироватьОписание(ИмяМодуля, ДобавляетГруппы = Истина) Экспорт
	
	Модуль = Вычислить(ИмяМодуля);
	Спецификация = РатOpenAPI.СпецификацияСервиса();
	
	Модуль.ЗарегистрироватьОписание(Спецификация);
	
	Утверждения = ЮТест.ОжидаетЧто(Спецификация)
		.Свойство("paths").Заполнено()
		.Свойство("components").Заполнено()
	;
	
	Если ДобавляетГруппы Тогда
		Утверждения.Свойство("tags").Заполнено();
	Иначе
		Утверждения.Свойство("tags").НеЗаполнено();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОписаниеAPI() Экспорт
	
	Описание = РатСпецификация.ОписаниеAPI();
	
	ПутьКОшибке = ПроверитьСериализациюВложений(Описание);
	
	ЮТест.ОжидаетЧто(ПутьКОшибке, "Путь к ошибке сериализации").НеЗаполнено()
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СтрокаJSON(Значение)
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	
	ЗаписатьJSON(Запись, Значение);
	
	Запись.Закрыть();

КонецПроцедуры

Функция ПроверитьСериализациюВложений(Значение)
	
	Путь = "";
	ПроблемныйЭлемент = Неопределено;
	
	Если ТипЗнч(Значение) = Тип("Структура") ИЛИ ТипЗнч(Значение) = Тип("Соответствие") Тогда
		
		Счетчик = 0;
		Для Каждого Элемент Из Значение Цикл
			Попытка
				СтрокаJSON(Элемент.Значение);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ПроблемныйЭлемент = Элемент.Значение;
				Путь = СтрШаблон("%1(%2)", Элемент.Ключ, Счетчик);
				Прервать;
			КонецПопытки;
			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Массив") Тогда
		
		Для Инд = 0 По Значение.ВГраница() Цикл
			Попытка
				СтрокаJSON(Значение[Инд]);
			Исключение
				Ошибка = ИнформацияОбОшибке();
				ПроблемныйЭлемент = Значение[Инд];
				Путь = "[" + Инд + "]";
				Прервать;
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;
	
	Если ПроблемныйЭлемент = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ВложенныйПуть = ПроверитьСериализациюВложений(ПроблемныйЭлемент);
	
	Если НЕ ЗначениеЗаполнено(ВложенныйПуть) Тогда
		Сообщить(ПодробноеПредставлениеОшибки(Ошибка)); // BSLLS:DeprecatedMethods8317-off
		Возврат Путь;
	Иначе
		Возврат Путь + "." + ВложенныйПуть;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
