//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ТипПоПредставлению")
			.СПараметрами("CatalogRef.ПУБ_Номенклатура", Тип("СправочникСсылка.ПУБ_Номенклатура"))
			.СПараметрами("EnumRef.ПУБ_ВидыОпераций", Тип("ПеречислениеСсылка.ПУБ_ВидыОпераций"))
			.СПараметрами("string", Тип("Строка"))
			.СПараметрами("decimal", Тип("Число"))
			.СПараметрами("dateTime", Тип("Дата"))
			.СПараметрами("boolean", Тип("Булево"))
		.ДобавитьТест("ЭтоСсылочныйТип")
			.СПараметрами("СправочникСсылка.ПУБ_Номенклатура", Истина)
			.СПараметрами("СправочникОбъект.ПУБ_Номенклатура", Ложь)
			.СПараметрами("ПеречислениеСсылка.ПУБ_ВидыОпераций", Истина)
			.СПараметрами("РегистрСведенийКлючЗаписи.ПУБ_КомментарииПоОбъекту", Ложь)
			.СПараметрами("Булево", Ложь)
			.СПараметрами("Неопределено", Ложь)
		.ДобавитьТест("ТипПоИмениТаблицы")
			.СПараметрами("Справочник.ПУБ_Номенклатура", "Ссылка", "СправочникСсылка.ПУБ_Номенклатура")
			.СПараметрами("Документ.ПУБ_Чек", "Менеджер", "ДокументМенеджер.ПУБ_Чек")
			.СПараметрами("Перечисление.ПУБ_ТипыОбъектов", "Ссылка", "ПеречислениеСсылка.ПУБ_ТипыОбъектов")
			.СПараметрами("РегистрСведений.ПУБ_ПериодическаяКонстанта", "НаборЗаписей", "РегистрСведенийНаборЗаписей.ПУБ_ПериодическаяКонстанта")
			.СПараметрами("РегистрНакопления.ПУБ_ОстаткиТоваров", "КлючЗаписи", "РегистрНакопленияКлючЗаписи.ПУБ_ОстаткиТоваров")
		.ДобавитьТест("ЭтоСоставнойТип")
			.СПараметрами("СправочникСсылка.ПУБ_Номенклатура", Ложь)
			.СПараметрами("Строка, СправочникСсылка.ПУБ_Номенклатура", Истина)
			.СПараметрами("Неопределено, СправочникСсылка.ПУБ_Номенклатура", Ложь)
			.СПараметрами("Null, СправочникСсылка.ПУБ_Номенклатура", Ложь)
			.СПараметрами("Число, Строка", Истина)
		.ДобавитьТест("ПредставлениеТипа")
			.СПараметрами("СправочникСсылка.ПУБ_ОбъектыМетаданных", "CatalogRef.ПУБ_ОбъектыМетаданных")
			.СПараметрами("Строка", "string")
			.СПараметрами("Число", "decimal")
	;
	
КонецПроцедуры

Процедура ТипПоПредставлению(Представление, ОжидаемыйТип) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ТипПоПредставлению(Представление))
		.Равно(ОжидаемыйТип);
	
КонецПроцедуры

Процедура ЭтоСсылочныйТип(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ЭтоСсылочныйТип(Тип(ИмяТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ТипПоИмениТаблицы(Имя, Суффикс, ОжидаемыйТип) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ТипПоИмениТаблицы(Имя, Суффикс))
		.Равно(Тип(ОжидаемыйТип));
	
КонецПроцедуры

Процедура ЭтоСоставнойТип(ОписаниеТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ЭтоСоставнойТип(Новый ОписаниеТипов(ОписаниеТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

Процедура ПредставлениеТипа(ИмяТипа, ОжидаемыйРезультат) Экспорт
	
	ЮТест.ОжидаетЧто(РатТипыДанных.ПредставлениеТипа(Тип(ИмяТипа)))
		.Равно(ОжидаемыйРезультат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
