//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ЭтоПримитивныйТип")
	;
	
КонецПроцедуры

Процедура ЭтоПримитивныйТип() Экспорт
	
	Варианты = Новый Массив();
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Строка"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Число"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Булево"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Строка"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Неопределено"), Истина));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Дата"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("УникальныйИдентификатор"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("Массив"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("СправочникСсылка.ПУБ_Номенклатура"), Ложь));
	Варианты.Добавить(Новый Структура("Тип, Результат", Тип("РегистрСведенийКлючЗаписи.ПУБ_КомментарииПоОбъекту"), Ложь));
	
	Для Каждого Вариант Из Варианты Цикл
		
		Результат = РатJSON.ЭтоПримитивныйТипJSON(Вариант.Тип);
		ЮТест.ОжидаетЧто(Результат, "ЭтоПримитивныйТип для " + Вариант.Тип)
			.Равно(Вариант.Результат, "верно определен примитивный тип");
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
