//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ОписаниеПеременных

// Обработчик оповещения для выполнения при срабатывании таймера
&НаКлиенте
Перем Обработчик;

// Признак активности таймера
&НаКлиенте
Перем Включен;

// Параметры настройки интервалов ожидания таймера
&НаКлиенте
Перем ПараметрыОжидания;

// Признак включения отладочных сообщений
&НаКлиенте
Перем ОтладкаВключена;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Старт(ОписаниеОповещения, Знач ВходныеПараметрыОжидания = Неопределено) Экспорт
	
	Включен = Истина;
	
	ПараметрыОжидания = ПараметрыОжидания();
	
	Если ВходныеПараметрыОжидания <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыОжидания, ВходныеПараметрыОжидания);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыОжидания.НачальныйИнтервал) Тогда
		ПараметрыОжидания.ТекущийИнтервал = ПараметрыОжидания.НачальныйИнтервал;
	КонецЕсли;
	
	Обработчик = ОписаниеОповещения;
	ПодключитьОбработчикОжидания("Тик", ПараметрыОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Стоп() Экспорт
	
	Включен = Ложь;
	ОтключитьОбработчикОжидания("Тик");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтладку(Включена) Экспорт
	
	ОтладкаВключена = Включена;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыОжидания(Параметры) Экспорт
	
	ПараметрыОжидания = Параметры;
	
КонецПроцедуры

&НаКлиенте
Процедура Тик()
	
	Если ОтладкаВключена Тогда
		РатОбщийКлиентСервер.СообщитьПользователю("Тик");
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Обработчик, ЭтотОбъект);
	
	Если Включен Тогда
		Если ОтладкаВключена Тогда
			РатОбщийКлиентСервер.СообщитьПользователю(СтрШаблон("Пауза %1 сек.", ПараметрыОжидания.ТекущийИнтервал));
		КонецЕсли;
		ПодключитьОбработчикОжидания("Тик", ПараметрыОжидания.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыОжидания()
	
	ПараметрыОжидания = Новый Структура;
	ПараметрыОжидания.Вставить("МаксимальныйИнтервал", 15);
	ПараметрыОжидания.Вставить("НачальныйИнтервал", 1);
	ПараметрыОжидания.Вставить("ТекущийИнтервал", 1);
	ПараметрыОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
	
	Возврат ПараметрыОжидания;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПараметрыОжидания() Экспорт
	
	ПараметрыОжидания.ТекущийИнтервал = ПараметрыОжидания.ТекущийИнтервал * ПараметрыОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОжидания.ТекущийИнтервал > ПараметрыОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОжидания.ТекущийИнтервал = ПараметрыОжидания.МаксимальныйИнтервал;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
