//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии(ДополнительныеПараметры = Неопределено) Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("КлассыОшибок")
		.ДобавитьТест("НовыйСтатусОбработкиЗапроса")
		.ДобавитьТест("ЗафиксироватьОшибку")
	;
	
КонецПроцедуры

Процедура ЗафиксироватьОшибку() Экспорт
	
	Результат = ПомощникТестированияРат.Статус();
	РатОбщий.ЗафиксироватьОшибку(Результат, РатОбщий.КлассыОшибок().РазборПараметровЗапроса, "Не удалось");
	
	ЮТест.ОжидаетЧто(Результат, "Статус обработки")
		.Свойство("Успешно").ЭтоЛожь("сбросился флаг успешности")
		.Свойство("ОписаниеОшибки").Заполнено("зарегистрировалась ошибка")
		.Свойство("ОписаниеОшибки").ИмеетДлину(1, "только одна ошибка");
	
КонецПроцедуры

Процедура КлассыОшибок() Экспорт
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	
	ЮТест.ОжидаетЧто(КлассыОшибок, "Классы ошибок")
		.Свойство("Неизвестная")
		.Свойство("Неизвестная.КодСостояния").Равно(500)
		.Свойство("НеподдерживаемаяФункциональность")
		.Свойство("ЛогикаКонфигурации")
		.Свойство("ЗаписьДанныхВБазу")
		.Свойство("РазборПараметровЗапроса")
		.Свойство("АнализПараметровЗапроса")
		.Свойство("Десериализация")
		.Свойство("Десериализация.КодСостояния").Равно(400)
		.Свойство("Сериализация")
		.Свойство("НедоступнаяФункциональность")
		.Свойство("НеНайденМаршрут")
		.Свойство("НеНайденаЗаписьИБ")
		.Свойство("НеНайденаЗаписьИБ.КодСостояния").Равно(404)
		.Свойство("МетодНеПоддерживается")
		.Свойство("МетодНеПоддерживается.КодСостояния").Равно(405)
	;
	
КонецПроцедуры

Процедура НовыйСтатусОбработкиЗапроса() Экспорт
	
	Результат = ПомощникТестированияРат.Статус();
	ЮТест.ОжидаетЧто(Результат, "Статус по умолчанию")
		.ИмеетТип("Структура")
		.Свойство("Успешно").ЭтоИстина()
		.Свойство("ОписаниеОшибки").ИмеетТип("Массив")
		.Свойство("ОписаниеОшибки").НеЗаполнено();
	
КонецПроцедуры

#КонецОбласти
