//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("КлассыОшибок")
		.ДобавитьТест("НовыйСтатусОбработкиЗапроса")
		.ДобавитьТест("ЗафиксироватьОшибку")
	;
	
КонецПроцедуры

Процедура ЗафиксироватьОшибку() Экспорт
	
	Результат = ПомощникТестированияРат.Статус();
	РатОбщий.ЗафиксироватьОшибку(Результат, РатОбщий.КлассыОшибок().РазборПараметровЗапроса, "Не удалось");
	
	ЮТест.ОжидаетЧто(Результат, "Статус обработки")
		.Свойство("Успешно").ЭтоЛожь("сбросился флаг успешности")
		.Свойство("ОписаниеОшибки").Заполнено("зарегистрировалась ошибка")
		.Свойство("ОписаниеОшибки").ИмеетДлину(1, "только одна ошибка");
	
КонецПроцедуры

Процедура КлассыОшибок() Экспорт
	
	КлассыОшибок = РатОбщий.КлассыОшибок();
	
	ЮТест.ОжидаетЧто(КлассыОшибок, "Классы ошибок")
		.Свойство("Неизвестная")
		.Свойство("Неизвестная.КодСостояния").Равно(500)
		.Свойство("НеподдерживаемаяФункциональность")
		.Свойство("ЛогикаКонфигурации")
		.Свойство("ЗаписьДанныхВБазу")
		.Свойство("РазборПараметровЗапроса")
		.Свойство("АнализПараметровЗапроса")
		.Свойство("Десериализация")
		.Свойство("Десериализация.КодСостояния").Равно(400)
		.Свойство("Сериализация")
		.Свойство("НедоступнаяФункциональность")
		.Свойство("НеНайденМаршрут")
		.Свойство("НеНайденаЗаписьИБ")
		.Свойство("НеНайденаЗаписьИБ.КодСостояния").Равно(404)
		.Свойство("МетодНеПоддерживается")
		.Свойство("МетодНеПоддерживается.КодСостояния").Равно(405)
	;
	
КонецПроцедуры

Процедура НовыйСтатусОбработкиЗапроса() Экспорт
	
	Результат = ПомощникТестированияРат.Статус();
	ЮТест.ОжидаетЧто(Результат, "Статус по умолчанию")
		.ИмеетТип("Структура")
		.Свойство("Успешно").ЭтоИстина()
		.Свойство("ОписаниеОшибки").ИмеетТип("Массив")
		.Свойство("ОписаниеОшибки").НеЗаполнено();
	
КонецПроцедуры

#КонецОбласти
