//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("СериализованноеЗначение_Ссылка")
			.СПараметрами("Справочники.ПУБ_Номенклатура", "CatalogRef.ПУБ_Номенклатура")
			.СПараметрами("Документы.ПУБ_Чек", "DocumentRef.ПУБ_Чек")
		.ДобавитьТест("СериализованноеЗначение_Перечисление")
			.СПараметрами(Перечисления.ПУБ_ВидыОпераций.Приход, "EnumRef.ПУБ_ВидыОпераций", "Приход")
			.СПараметрами(Перечисления.ПУБ_ТипыОбъектов.Документ, "EnumRef.ПУБ_ТипыОбъектов", "Документ")
	;
	
КонецПроцедуры

Процедура СериализованноеЗначение_Ссылка(ТипОбъекта, ОжидаемыйType) Экспорт
	
	Ссылка = ЮТест.Данные().КонструкторОбъекта(ТипОбъекта)
		.ФикцияОбязательныхПолей()
		.Записать();
	
	Результат = РатСериализация.СериализованноеЗначение(Ссылка);
	
	ЮТест.ОжидаетЧто(Результат)
		.Заполнено()
		.ИмеетТип("Структура")
		.Свойство("type").Равно(ОжидаемыйType)
		.Свойство("id")
			.ИмеетТип("Строка")
			.ИмеетДлину(36)
		.Свойство("presentation").Равно(Строка(Ссылка))
	
КонецПроцедуры

Процедура СериализованноеЗначение_Перечисление(ЗначениеПеречисления, ОжидаемыйType, Идентификатор) Экспорт
	
	Результат = РатСериализация.СериализованноеЗначение(ЗначениеПеречисления);
	
	ЮТест.ОжидаетЧто(Результат)
		.Заполнено()
		.ИмеетТип("Структура")
		.Свойство("type").Равно(ОжидаемыйType)
		.Свойство("id")
			.Равно(Идентификатор)
		.Свойство("presentation").Равно(Строка(ЗначениеПеречисления))
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
