//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьОтвет(Ответ, Описание, КодСостояния = 200) Экспорт
	
	ЮТест.ОжидаетЧто(Ответ, Описание)
		.ИмеетТип(Тип("HTTPСервисОтвет"))
		.Свойство("КодСостояния").Равно(КодСостояния, "верный код состояния. Тело: " + Ответ.ПолучитьТелоКакСтроку());
	
КонецПроцедуры

Процедура ПроверитьРезультатУспешно(Результат, Описание = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Описание) Тогда
		ОписаниеКейса = СтрШаблон("%1. Возникли ошибки: %2", Описание, ТестированиеСервер.Представление(Результат));
	Иначе
		ОписаниеКейса = СтрШаблон("Возникли ошибки: %1", ТестированиеСервер.Представление(Результат));
	КонецЕсли;
	
	ЮТест.ОжидаетЧто(Результат, ОписаниеКейса)
		.Свойство("ОписаниеОшибки").НеЗаполнено()
		.Свойство("Успешно").ЭтоИстина();
	
КонецПроцедуры

Процедура ПроверитьРезультатОшибка(Результат, Описание = "", КлассОшибки = Неопределено) Экспорт
	
	ЮТест.ОжидаетЧто(Результат, Описание)
		.Свойство("Успешно").ЭтоЛожь("провальный обработчик")
		.Свойство("ОписаниеОшибки").Заполнено("не зарегистрированы ошибки");
	Если ЗначениеЗаполнено(КлассОшибки) Тогда
		ЮТест.ОжидаетЧто(Результат.ОписаниеОшибки[0].Класс, Описание)
			.Равно(КлассОшибки, "не верный класс ошибки");
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаISO8601(Дата) Экспорт
	
	Возврат Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss;");
	
КонецФункции

Функция НовыйЗапрос(Адрес, Метод) Экспорт
	
	Запрос = СтруктураЗапроса();
	Запрос.ОтносительныйURL = Адрес;
	Запрос.HTTPМетод = Метод;
	
	Возврат Запрос;
	
КонецФункции

Функция СтруктураЗапроса(ContentType = "application/json") Экспорт
	
	Запрос = ЮТест.Данные().HTTPСервисЗапрос();
	
	Если ЗначениеЗаполнено(ContentType) Тогда
		Запрос.Заголовки.Вставить("Content-Type", ContentType);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ТаблицаГеркин(Строка) Экспорт
	
	КоличествоКолонок = СтрЧислоВхождений(СтрПолучитьСтроку(Строка, 1), "|") - 1;
	Заголовок = "";
	Разделитель = "|" + Символы.ПС;
	Для Инд = 1 По КоличествоКолонок Цикл
		Заголовок = Заголовок + "| Кол" + Инд;
		Разделитель = Разделитель + "| --- ";
	КонецЦикла;
	
	Таблица = Заголовок + Разделитель + "|" + Символы.ПС + Строка;
	
	Возврат ЮТест.Данные().ТаблицаMarkDown(Таблица);
	
КонецФункции

#Область ТестовыеДанные

Функция Статус() Экспорт
	
	Возврат РатОбщий.НовыйСтатусОбработкиЗапроса();
	
КонецФункции

Функция ПараметрыЗапроса(Адрес, Тело, СтатусОбработкиЗапроса) Экспорт
	
	ЧастиИмениТаблицы = СтрРазделить(Адрес, "/");
	ПараметрыЗапроса = Новый Структура("ТипМетаданных, ВидМетаданных, ИмяТаблицы, Идентификатор, Тело");
	ПараметрыЗапроса.ТипМетаданных = ЧастиИмениТаблицы[0];
	ПараметрыЗапроса.Тело = Тело;
	Если ЧастиИмениТаблицы.Количество() > 1 Тогда
		ПараметрыЗапроса.ВидМетаданных = ЧастиИмениТаблицы[1];
	КонецЕсли;
	
	Если ЧастиИмениТаблицы.Количество() > 2 Тогда
		ПараметрыЗапроса.Идентификатор = ЧастиИмениТаблицы[2];
	КонецЕсли;
	
	МетаданныеЗапроса = РатСервис.МетаданныеЗапроса(ПараметрыЗапроса, СтатусОбработкиЗапроса);
	ПроверитьРезультатУспешно(СтатусОбработкиЗапроса, "Получение описания метаданных из запроса");
	РатКоллекции.ОбъединитьВСтруктуру(ПараметрыЗапроса, МетаданныеЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПараметрыОбработчикаЗапроса(Обработчик, Адрес, Тело = Неопределено, Статус) Экспорт
	
	Для Каждого Шаблон Из РатШаблоныАдресов.Шаблоны() Цикл
		
		Если СтрСравнить(Шаблон.Обработчик, Обработчик) = 0 Тогда
			ШаблонОбработчика = Шаблон;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ШаблонОбработчика = Неопределено Тогда
		ВызватьИсключение "Не удалось найти шаблон обработчика " + Обработчик;
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Структура("Параметры, Тело");
	ПараметрыЗапроса.Параметры = Новый Соответствие();
	ПараметрыЗапроса.Тело = Тело;
	
	РатКоллекции.ОбъединитьВСтруктуру(ПараметрыЗапроса, РатШаблоныАдресов.ПараметрыURL(ШаблонОбработчика, Адрес));
	
	МетаданныеЗапроса = РатСервис.МетаданныеЗапроса(ПараметрыЗапроса, Статус);
	ПроверитьРезультатУспешно(Статус, "Получение описания метаданных из запроса");
	РатКоллекции.ОбъединитьВСтруктуру(ПараметрыЗапроса, МетаданныеЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ВызватьОбработчик(Модуль, Обработчик, Адрес, Тело = Неопределено) Экспорт
	
	ОбработчикВыполнен = Ложь;
	
	Статус = Статус();
	Параметры = ПараметрыОбработчикаЗапроса(Обработчик, Адрес, Тело, Статус);
	
	Статус.Результат = Модуль.ВызватьОбработчик(Обработчик, Параметры, Статус, ОбработчикВыполнен);
	
	ЮТест.ОжидаетЧто(ОбработчикВыполнен)
		.ЭтоИстина("Обработчик не выполнен");
	
	Возврат Статус;
	
КонецФункции

#КонецОбласти

Функция ЗапросAPI(Адрес, Метод, Тело) Экспорт
	
	Запрос = ЮТест.Данные().HTTPСервисЗапрос()
		.ОтносительныйURL(Адрес)
		.Метод(Метод)
		.УстановитьТелоКакСтрокуJSON(Тело);
	
	Ответ = РатСервис.ЗапросAPI(Запрос);
	
	Результат = Новый Структура();
	Результат.Вставить("КодСостояния", Ответ.КодСостояния);
	Результат.Вставить("Тело", Ответ.ПолучитьТелоКакСтроку());
	Результат.Вставить("Данные", РатJSON.ОбъектИзСтроки(Результат.Тело));
	
	Возврат Результат;
	
КонецФункции

Функция ОбъектИзСтроки(Строка) Экспорт
	
	Возврат РатJSON.ОбъектИзСтроки(Строка);
	
КонецФункции

Функция КонфигурацияНаОснованииБСП() Экспорт
	
	Возврат Метаданные.Константы.Найти("ИспользоватьИнтеграциюYAX") <> Неопределено;
	
КонецФункции

Функция ТестовыеМетаданныеТаблицы(ИмяТаблицы) Экспорт
	
	Возврат РатМетаданные.МетаданныеТаблицы(ИмяТаблицы, Неопределено);
	
КонецФункции

Функция КлассыОшибок() Экспорт
	
	Возврат РатОбщий.КлассыОшибок();
	
КонецФункции

Функция ИдентификаторСсылки(Знач Ссылка) Экспорт
	
	Возврат СтрШаблон("%1.%2", Ссылка.Метаданные().Имя, Ссылка.УникальныйИдентификатор());
	
КонецФункции

#КонецОбласти
