#language: ru
@Tree

Функционал: Выполнение REST запросов и обработка результата

	Как тестировщик
	Я хочу чтобы была возможность искать данные в другой информационной системе.

Контекст:

	И Я устанавливаю настройки подключения к внешней системе "jsonplaceholder"
	| Сервер  | https://jsonplaceholder.typicode.com |
	Дано Я устанавливаю заголовки запроса к внешней системе "jsonplaceholder"
	| Content-type | application/json; charset=UTF-8 |

Сценарий: Работа с площадкой

	И Я выполняю запрос "GET" к ресурсу "/posts" внешней системы "jsonplaceholder"
	И Я сохраняю в переменную "post_id" реквизит результата запроса "[0].id"
	И Я выполняю запрос "GET" к ресурсу "/posts/$post_id$/comments" внешней системы "jsonplaceholder"
	И Я задаю таблицу строк "Комментарии"
	| Первый |
	| Второй |
	И Я создаю структуру "ДанныеПоста"
	| title    | Тестовый пост     |
	| body     | Это тестовый пост |
	| userId   | 1                 |
	| comments | $Комментарии$     |
	И Я выполняю запрос "POST" к ресурсу "/posts" внешней системы "jsonplaceholder" с параметрами
	| title  | Тестовый пост     |
	| body   | Это тестовый пост |
	| userId | 1                 |
	И реквизит результата запроса "id" равен "101"
	И Я выполняю запрос "GET" к ресурсу "/posts" внешней системы "jsonplaceholder" с параметрами
	| userId | 2 |
	Тогда реквизит результата запроса "[0].userId" равен "2"
	И реквизит результата запроса "[0].title" равен "et ea vero quia laudantium autem"
	И реквизит результата запроса "[0].id" равен "11"
