#language: ru
@Tree

Функционал: Выполнение REST запросов и обработка результата

	Как тестировщик
	Я хочу чтобы была возможность обрабатывать результат запроса.

Контекст:

	Дано выполнена настройка подключения

Сценарий: Сохранение переменной с приведением типа

	Дано Я запоминаю значение выражения '"Тест_" + Строка(Новый УникальныйИдентификатор)' в переменную "Наименование"
	И Я запоминаю значение выражения 'Строка(Новый УникальныйИдентификатор)' в переменную "УникальныйКод"
	И Я создаю запись "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST"
		| Наименование | $Наименование$      |          |
		| Код          | $УникальныйКод$     | string   |
	Когда Я получаю запись "Справочник.ПУБ_Номенклатура.$Наименование$" внешней системы "RAT_REST"
	И Я сохраняю в переменную "ЗначениеКода" реквизит результата запроса "Код" с типом "Строка"
	Тогда выражение внутреннего языка 'ТипЗнч($ЗначениеКода$) = Тип("Строка")' Истинно

Сценарий: Проверка по шаблону

	Дано Я запоминаю значение выражения '"Тест_" + Строка(Новый УникальныйИдентификатор)' в переменную "Наименование"
	И Я запоминаю значение выражения '"ТестКод_" + Строка(Новый УникальныйИдентификатор)' в переменную "УникальныйКод"
	И Я создаю запись "Справочник.ПУБ_Номенклатура" внешней системы "RAT_REST"
		| Наименование | $Наименование$        |        |
		| Код          | $УникальныйКод$       | string |
	Когда Я получаю запись "Справочник.ПУБ_Номенклатура.$Наименование$" внешней системы "RAT_REST"
	Тогда реквизит результата запроса "Код" соответствует шаблону "ТестКод*"
	И реквизит результата запроса "Код" соответствует шаблону "*Код*"

Сценарий: Проверка многострочного реквизита по шаблону

	Дано Я запоминаю значение выражения '"Объект_" + Строка(Новый УникальныйИдентификатор)' в переменную "Наименование"
	И Я запоминаю значение выражения '"Съешь" + Символы.ПС + "ещё" + Символы.ПС + "этих" + Символы.ПС + "французских" + Символы.ПС + "булок"' в переменную "Описание"
	И Я создаю запись "Справочник.ПУБ_ОбъектыМетаданных" внешней системы "RAT_REST"
		| Наименование | $Наименование$ |
		| Описание     | $Описание$     |
	Когда Я получаю запись "Справочник.ПУБ_ОбъектыМетаданных.$Наименование$" внешней системы "RAT_REST"
	Тогда реквизит результата запроса "Описание" соответствует шаблону "Съешь*булок"
	И реквизит результата запроса "Описание" соответствует шаблону "Съешь*этих*булок"
	И реквизит результата запроса "Описание" соответствует шаблону "*этих*булок"
