#©######################################################################/©#
#
#  This file is a part of RAT.
#
#  Copyright © 2021-2025
#  BIA-Technologies Limited Liability Company and contributors
#
#  SPDX-License-Identifier: LGPL-3.0-or-later
#
#  RAT is free software: you can redistribute it and/or modify
#  it under the terms of the GNU Lesser General Public License as published by
#  the Free Software Foundation; either version 3.0 of the License, or
#  (at your option) any later version.
#
#  RAT is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
#  GNU Lesser General Public License for more details.
#
#  You should have received a copy of the GNU Lesser General Public License
#  along with RAT. If not, see <https://www.gnu.org/licenses/>.
#
#©######################################################################/©#

#language: ru
@tree

Функционал: Формирование данных

Сценарий: Структура данных

	Когда Я создаю структуру "Данные"
		| Строка | Это строка |
		| Число  | 15         |
		| Булево | Истина     |
	Тогда выражение внутреннего языка 'Контекст.Данные.Строка' имеет значение 'Это строка'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Строка))' имеет значение 'Строка'
	И выражение внутреннего языка 'Контекст.Данные.Число' имеет значение '{15}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Число))' имеет значение 'Число'
	И выражение внутреннего языка 'Контекст.Данные.Булево' имеет значение 'Истина'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Булево))' имеет значение 'Строка'

Сценарий: Типизированная структура данных

	Когда Я создаю типизированную структуру "Данные"
		| Строка | Это строка          |          |
		| Число  | 15                  |          |
		| Булево | Истина              | boolean  |
		| Дата   | 1970-12-18T15:12:30 | dateTime |
	Тогда выражение внутреннего языка 'Контекст.Данные.Строка' имеет значение 'Это строка'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Строка))' имеет значение 'Строка'
	И выражение внутреннего языка 'Контекст.Данные.Число' имеет значение '{15}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Число))' имеет значение 'Число'
	И выражение внутреннего языка 'Контекст.Данные.Булево' имеет значение '{Истина}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Булево))' имеет значение 'Булево'
	И выражение внутреннего языка 'Контекст.Данные.Дата.value' имеет значение '1970-12-18T15:12:30'
	И выражение внутреннего языка 'Контекст.Данные.Дата.type' имеет значение 'dateTime'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Дата))' имеет значение 'Структура'

Сценарий: Типизированная переменная

	И Я создаю переменную "Ссылка" с типом "Справочник.Пользователи" и значением "root"
	И выражение внутреннего языка 'Контекст.Ссылка.value' имеет значение 'root'
	И выражение внутреннего языка 'Контекст.Ссылка.type' имеет значение 'Справочник.Пользователи'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Ссылка))' имеет значение 'Структура'

Сценарий: Массив данных

	Когда Я создаю массив "Данные"
		| Строка |
		| Число  |
		| Булево |
	Тогда выражение внутреннего языка 'Контекст.Данные[0]' имеет значение 'Строка'
	Тогда выражение внутреннего языка 'Контекст.Данные[2]' имеет значение 'Булево'
	Когда Я создаю массив "ДанныеИзСтроки" "Строка;Число;Булево"
	Тогда выражение внутреннего языка 'Контекст.ДанныеИзСтроки[0]' имеет значение 'Строка'
	Тогда выражение внутреннего языка 'Контекст.ДанныеИзСтроки[2]' имеет значение 'Булево'
	Когда Я создаю массив "ПустойМассив" ""
	Тогда выражение внутреннего языка 'Контекст.ПустойМассив.Количество()' имеет значение '{0}'
