#language: ru
@tree

Функционал: Формирование данных

Сценарий: Структура данных

	Когда Я создаю структуру "Данные"
		| Строка | Это строка |
		| Число  | 15         |
		| Булево | Истина     |
	Тогда выражение внутреннего языка 'Контекст.Данные.Строка' имеет значение 'Это строка'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Строка))' имеет значение 'Строка'
	И выражение внутреннего языка 'Контекст.Данные.Число' имеет значение '{15}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Число))' имеет значение 'Число'
	И выражение внутреннего языка 'Контекст.Данные.Булево' имеет значение 'Истина'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Булево))' имеет значение 'Строка'

Сценарий: Типизированная структура данных

	Когда Я создаю типизированную структуру "Данные"
		| Строка | Это строка          |          |
		| Число  | 15                  |          |
		| Булево | Истина              | boolean  |
		| Дата   | 1970-12-18T15:12:30 | dateTime |
	Тогда выражение внутреннего языка 'Контекст.Данные.Строка' имеет значение 'Это строка'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Строка))' имеет значение 'Строка'
	И выражение внутреннего языка 'Контекст.Данные.Число' имеет значение '{15}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Число))' имеет значение 'Число'
	И выражение внутреннего языка 'Контекст.Данные.Булево' имеет значение '{Истина}'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Булево))' имеет значение 'Булево'
	И выражение внутреннего языка 'Контекст.Данные.Дата.value' имеет значение '1970-12-18T15:12:30'
	И выражение внутреннего языка 'Контекст.Данные.Дата.type' имеет значение 'dateTime'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Данные.Дата))' имеет значение 'Структура'

Сценарий: Типизированная переменная

	И Я создаю переменную "Ссылка" с типом "Справочник.Пользователи" и значением "root"
	И выражение внутреннего языка 'Контекст.Ссылка.value' имеет значение 'root'
	И выражение внутреннего языка 'Контекст.Ссылка.type' имеет значение 'Справочник.Пользователи'
	И выражение внутреннего языка 'Строка(ТипЗнч(Контекст.Ссылка))' имеет значение 'Структура'

Сценарий: Массив данных

	Когда Я создаю массив "Данные"
		| Строка |
		| Число  |
		| Булево |
	Тогда выражение внутреннего языка 'Контекст.Данные[0]' имеет значение 'Строка'
	Тогда выражение внутреннего языка 'Контекст.Данные[2]' имеет значение 'Булево'
	Когда Я создаю массив "ДанныеИзСтроки" "Строка;Число;Булево"
	Тогда выражение внутреннего языка 'Контекст.ДанныеИзСтроки[0]' имеет значение 'Строка'
	Тогда выражение внутреннего языка 'Контекст.ДанныеИзСтроки[2]' имеет значение 'Булево'
	Когда Я создаю массив "ПустойМассив" ""
	Тогда выражение внутреннего языка 'Контекст.ПустойМассив.Количество()' имеет значение '{0}'
