//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ТипыСодержимого")
		.ДобавитьТест("ТекстОшибки")
		.ДобавитьТест("ПараметрыЗапускаПриложения")
		.ДобавитьТест("ПараметрыЗапускаПриложения_СтрокаСНевалиднымиСимолами")
	;
	
КонецПроцедуры

Процедура ТипыСодержимого() Экспорт
	
	Результат = РатОбщийКлиентСервер.ТипыСодержимого();
	
	ЮТест.ОжидаетЧто(Результат, "ТипыСодержимого")
		.Свойство("Текст").Равно("text/plain")
		.Свойство("HTML").Равно("text/html")
		.Свойство("JSON").Равно("application/json")
	
КонецПроцедуры

Процедура ТекстОшибки() Экспорт
	
	Описание = "Тестовый прогон";
	Ошибка = "Ошибка";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ТекстОшибки(Ошибка), "представление ошибки без описания")
		.Равно(Ошибка);
	
	Ожидание = СтрШаблон("%1:%2%3", Описание, Символы.ПС, Ошибка);
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ТекстОшибки(Ошибка, Описание), "представление ошибки с описанием")
		.Равно(Ожидание);
	
КонецПроцедуры

Процедура ПараметрыЗапускаПриложения() Экспорт
	
	ВходнаяСтрока = "RATAwait=c:\tmp";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ПараметрыЗапускаПриложения(ВходнаяСтрока))
		.Заполнено()
		.Свойство("RATAwait").Равно("c:\tmp")
	;
	
КонецПроцедуры

Процедура ПараметрыЗапускаПриложения_СтрокаСНевалиднымиСимолами() Экспорт
	
	ВходнаяСтрока = "user@group$123;RATAwait=c:\tmp";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ПараметрыЗапускаПриложения(ВходнаяСтрока))
		.Заполнено()
		.Свойство("RATAwait").Равно("c:\tmp")
	;
	
КонецПроцедуры

#КонецОбласти
