//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ИсполняемыеСценарии
// 	Сервисный метод для получения списка тестовых методов
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ТипыСодержимого")
		.ДобавитьТест("ТекстОшибки")
		.ДобавитьТест("ПараметрыЗапускаПриложения")
		.ДобавитьТест("ПараметрыЗапускаПриложения_СтрокаСНевалиднымиСимолами")
	;
	
КонецПроцедуры

Процедура ТипыСодержимого() Экспорт
	
	Результат = РатОбщийКлиентСервер.ТипыСодержимого();
	
	ЮТест.ОжидаетЧто(Результат, "ТипыСодержимого")
		.Свойство("Текст").Равно("text/plain")
		.Свойство("HTML").Равно("text/html")
		.Свойство("JSON").Равно("application/json")
	
КонецПроцедуры

Процедура ТекстОшибки() Экспорт
	
	Описание = "Тестовый прогон";
	Ошибка = "Ошибка";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ТекстОшибки(Ошибка), "представление ошибки без описания")
		.Равно(Ошибка);
	
	Ожидание = СтрШаблон("%1:%2%3", Описание, Символы.ПС, Ошибка);
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ТекстОшибки(Ошибка, Описание), "представление ошибки с описанием")
		.Равно(Ожидание);
	
КонецПроцедуры

Процедура ПараметрыЗапускаПриложения() Экспорт
	
	ВходнаяСтрока = "RATAwait=c:\tmp";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ПараметрыЗапускаПриложения(ВходнаяСтрока))
		.Заполнено()
		.Свойство("RATAwait").Равно("c:\tmp")
	;
	
КонецПроцедуры

Процедура ПараметрыЗапускаПриложения_СтрокаСНевалиднымиСимолами() Экспорт
	
	ВходнаяСтрока = "user@group$123;RATAwait=c:\tmp";
	
	ЮТест.ОжидаетЧто(РатОбщийКлиентСервер.ПараметрыЗапускаПриложения(ВходнаяСтрока))
		.Заполнено()
		.Свойство("RATAwait").Равно("c:\tmp")
	;
	
КонецПроцедуры

#КонецОбласти
