//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3.0 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Преобразует значение в строку JSON.
//
// Параметры:
//   Объект - Произвольный - Объект, данные которого нужно преобразовать в JSON.
//   Параметры - Структура, Неопределено - Настройки преобразования:
//     + БезПреобразования - Булево - Не выполнять предварительную сериализацию значения.
//
// Возвращаемое значение:
//   Строка - Значение в JSON.
//
// Пример:
//   СтрокаJSON = РатJSON.ОбъектВСтроку(Новый Структура("Ключ", "Значение"));
//
Функция ОбъектВСтроку(Объект, Параметры = Неопределено) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение "Метод не поддерживается в веб-клиенте";
#Иначе
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	
	Если Параметры = Неопределено ИЛИ НЕ РатКоллекции.ЗначениеСтруктуры(Параметры, "БезПреобразования", Ложь) Тогда
		ПодготовленныеДанные = РатПреобразованияВызовСервера.СериализоватьЗначение(Объект);
	Иначе
		ПодготовленныеДанные = Объект;
	КонецЕсли;
	
	ЗаписатьJSON(Запись, ПодготовленныеДанные);
	
	Возврат Запись.Закрыть();
#КонецЕсли
	
КонецФункции

// Восстанавливает значение из строки JSON.
//
// Параметры:
//   Строка - Строка - Строка JSON.
//
// Возвращаемое значение:
//   Произвольный - Объект, восстановленный из строки JSON.
//
// Пример:
//   Объект = РатJSON.ОбъектИзСтроки("{"Ключ": "Значение"}");
//
Функция ОбъектИзСтроки(Строка) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение "Метод не поддерживается в веб-клиенте";
#Иначе
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);
	Объект = ПрочитатьJSON(Чтение);
	
	Чтение.Закрыть();
	
	//@skip-check constructor-function-return-section
	Возврат Объект;
#КонецЕсли
	
КонецФункции

// Проверяет, является ли переданный тип примитивным типом JSON.
//
// Параметры:
//   Тип - Тип - Тип для проверки.
//
// Возвращаемое значение:
//   Булево - Истина, если тип является примитивным типом JSON (Строка, Число, Булево, Неопределено).
//
// Пример:
//   Если РатJSON.ЭтоПримитивныйТипJSON(Тип("Строка")) Тогда ...
//
Функция ЭтоПримитивныйТипJSON(Тип) Экспорт
	
	ПримитивныеТипы = Новый ОписаниеТипов("Строка, Число, Булево, Неопределено");
	
	Возврат ПримитивныеТипы.СодержитТип(Тип);
	
КонецФункции

#КонецОбласти
