//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ВТранзакции()
		.ДобавитьТест("ПолучитьВсеДвижения")
		.ДобавитьТест("ПолучитьДвиженияПоРегистру")
		.ДобавитьТест("УстановитьДвижения")
			.СПараметрами(0).Представление("Очистка движений", Истина)
			.СПараметрами(2).Представление("Новый набор движений", Истина)
	;
	
КонецПроцедуры

Процедура ПолучитьВсеДвижения() Экспорт
	
	Чек = ДокументСДвижениями();
	
	Адрес = СтрШаблон("Документы/ПУБ_Чек/%1/Движения", Чек.Номер);
	Статус = ВызватьОбработчик("ПолучитьВсеДвижения", Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Получение движений документа");
	
	ЮТест.ОжидаетЧто(Статус)
		.Свойство("Результат")
			.Заполнено()
			.ИмеетТип("Структура")
		.Свойство("Результат.ПУБ_ОстаткиТоваров").ИмеетДлину(1);
	
КонецПроцедуры

Процедура ПолучитьДвиженияПоРегистру() Экспорт
	
	Чек = ДокументСДвижениями();
	
	Адрес = СтрШаблон("Документы/ПУБ_Чек/%1/Движения/ПУБ_ОстаткиТоваров", Чек.Номер);
	Статус = ВызватьОбработчик("ПолучитьДвиженияПоРегистру", Адрес);
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Получение движений документа по ОстаткиТоваров");
	
	ЮТест.ОжидаетЧто(Статус)
		.Свойство("Результат")
			.Заполнено()
			.ИмеетТип("ТаблицаЗначений")
			.ИмеетДлину(1);
	
КонецПроцедуры

Процедура УстановитьДвижения(Количество) Экспорт
	
	Чек = ДокументСДвижениями();
	Движения = Чек.ПолучитьОбъект().Движения.ПУБ_ОстаткиТоваров;
	Движения.Прочитать();
	ЮТест.ОжидаетЧто(Движения, "Движения до корректировки")
		.ИмеетДлину(1);
	
	Реквизиты = "Регистратор, Период, ВидДвижения, Номенклатура, Количество, Сумма";
	
	НовыеДвижения = Новый Массив;
	
	Период = '20251231';
	
	Для Инд = 1 По Количество Цикл
		НовыеДвижения.Добавить(Новый Структура(Реквизиты,
											   Чек,
											   Период,
											   "Приход",
											   ЮТест.Данные().СоздатьЭлемент(Справочники.ПУБ_Номенклатура),
											   Инд,
											   Инд * 3));
	КонецЦикла;
	
	Адрес = СтрШаблон("Документы/ПУБ_Чек/%1/Движения/ПУБ_ОстаткиТоваров", Чек.Номер);
	Статус = ВызватьОбработчик("УстановитьДвижения", Адрес, Новый Структура("data", НовыеДвижения));
	ПомощникТестированияРат.ПроверитьРезультатУспешно(Статус, "Установка движений документа по ОстаткиТоваров");
	
	Движения = Чек.ПолучитьОбъект().Движения.ПУБ_ОстаткиТоваров;
	Движения.Прочитать();
	ЮТест.ОжидаетЧто(Движения, "Движения после корректировки")
		.ИмеетДлину(Количество);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументСДвижениями()
	
	Конструктор = ЮТест.Данные().КонструкторОбъекта(Документы.ПУБ_Чек);
	Чек = Конструктор
		.ФикцияОбязательныхПолей()
		.Фикция("КассоваяСмена")
		.ТабличнаяЧасть("ТоварыУслуги")
			.ДобавитьСтроку()
				.Фикция("Номенклатура")
				.Установить("Цена", ЮТест.Данные().СлучайноеПоложительноеЧисло(9999, 2))
				.Установить("Количество", ЮТест.Данные().СлучайноеЧисло(1, 100))
				.Установить("Сумма", Конструктор.ДанныеСтроки().Цена * Конструктор.ДанныеСтроки().Количество)
		.Провести();
	
	Возврат Чек;
	
КонецФункции

Функция ВызватьОбработчик(Обработчик, Адрес, Тело = Неопределено)

	Возврат ПомощникТестированияРат.ВызватьОбработчик(РатДвижения, Обработчик, Адрес, Тело);

КонецФункции

#КонецОбласти
