//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет существование метода в указанном модуле.
//
// Параметры:
//   ИмяМодуля - Строка - имя модуля, в котором проверяется существование метода
//   ИмяМетода - Строка - имя проверяемого метода
//   Объект - Произвольный - объект, для которого проверяется метод (опционально)
//
// Возвращаемое значение:
//   Булево - Истина, если метод существует в указанном модуле
//
// Пример:
//   Если РатРасширениеФункциональностиКлиентСервер.МетодСуществует("РатОбщий", "НовыйСтатусОбработкиЗапроса") Тогда ...
//
Функция МетодСуществует(ИмяМодуля, ИмяМетода, Объект = Неопределено) Экспорт
	
#Если ВебКлиент Тогда
	ВызватьИсключение "Метод не поддерживается в веб-клиенте";
#Иначе
	ПолноеИмяМетода = СтрШаблон("%1.%2", ИмяМодуля, ИмяМетода);
	Алгоритм = ПолноеИмяМетода + "(,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,)";
	
	Попытка
		РатАлгоритмы.ВыполнитьАлгоритм(Алгоритм, Объект);
	Исключение
		Ошибка = ИнформацияОбОшибке();
	КонецПопытки;
	
	Возврат (Ошибка.Описание = "Слишком много фактических параметров"
			Или Ошибка.Описание = "Too many actual parameters")
		И СтрНачинаетсяС(Ошибка.ИсходнаяСтрока, ПолноеИмяМетода);
#КонецЕсли
	
КонецФункции

#КонецОбласти
