//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

///////////////////////////////////////////////////////////////////////////////
// 
// Служебный модуль с реализацией сценариев обработки файлов <Копирования изменений описания экспортных шагов>
//
///////////////////////////////////////////////////////////////////////////////

Перем КопированиеВыполнено;

// ИмяСценария
//	Возвращает имя сценария обработки файлов
//
// Возвращаемое значение:
//   Строка   - Имя текущего сценария обработки файлов
//
Функция ИмяСценария() Экспорт
	
	Возврат "Копирование описания сценариев";

КонецФункции // ИмяСценария()

// ОбработатьФайл
//	Выполняет обработку файла
//
// Параметры:
//  АнализируемыйФайл		- Файл - Файл из журнала git для анализа
//  КаталогИсходныхФайлов  	- Строка - Каталог расположения исходных файлов относительно каталог репозитория
//  ДополнительныеПараметры - Структура - Набор дополнительных параметров, которые можно использовать 
//  	* Лог  					- Объект - Текущий лог
//  	* ИзмененныеКаталоги	- Массив - Каталоги, которые необходимо добавить в индекс
//		* КаталогРепозитория	- Строка - Адрес каталога репозитория
//		* ФайлыДляПостОбработки	- Массив - Файлы, изменившиеся / образовавшиеся в результате работы сценария
//											и которые необходимо дообработать
//
// Возвращаемое значение:
//   Булево   - Признак выполненной обработки файла
//
Функция ОбработатьФайл(АнализируемыйФайл, КаталогИсходныхФайлов, ДополнительныеПараметры) Экспорт
	
	Сообщить("ОбработатьФайл");
	
	Если КопированиеВыполнено Тогда
		Возврат Ложь;
	КонецЕсли;

	ФайлШаблона = ОбъединитьПути("exts", "rat", "src", "DataProcessors");
	ФайлШаблона = ОбъединитьПути(ФайлШаблона, "РатШагиVA", "Templates", "ЭкспортныеШаги");
	ФайлШаблона = ОбъединитьПути(ФайлШаблона, "Template.txt");
	
	Назначение = ОбъединитьПути("doc", "docs", "functionality", "ЭкспортируемыеШаги.md");
	ДополнительныеПараметры.Лог.Информация(СтрШаблон("Скопирован файл %1 → %2", ФайлШаблона, Назначение));
	КопироватьФайл(ФайлШаблона, Назначение);
	ДополнительныеПараметры.ИзмененныеКаталоги.Добавить(Назначение);
	КопированиеВыполнено = Истина;
	
	Возврат Истина;

КонецФункции

КопированиеВыполнено = Ложь;
