//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

///////////////////////////////////////////////////////////////////////////////
// 
// Служебный модуль с реализацией сценариев обработки файлов <Копирования изменений описания экспортных шагов>
//
///////////////////////////////////////////////////////////////////////////////

Перем КопированиеВыполнено;

// ИмяСценария
//	Возвращает имя сценария обработки файлов
//
// Возвращаемое значение:
//   Строка   - Имя текущего сценария обработки файлов
//
Функция ИмяСценария() Экспорт
	
	Возврат "Копирование описания сценариев";

КонецФункции // ИмяСценария()

// ОбработатьФайл
//	Выполняет обработку файла
//
// Параметры:
//  АнализируемыйФайл		- Файл - Файл из журнала git для анализа
//  КаталогИсходныхФайлов  	- Строка - Каталог расположения исходных файлов относительно каталог репозитория
//  ДополнительныеПараметры - Структура - Набор дополнительных параметров, которые можно использовать 
//  	* Лог  					- Объект - Текущий лог
//  	* ИзмененныеКаталоги	- Массив - Каталоги, которые необходимо добавить в индекс
//		* КаталогРепозитория	- Строка - Адрес каталога репозитория
//		* ФайлыДляПостОбработки	- Массив - Файлы, изменившиеся / образовавшиеся в результате работы сценария
//											и которые необходимо дообработать
//
// Возвращаемое значение:
//   Булево   - Признак выполненной обработки файла
//
Функция ОбработатьФайл(АнализируемыйФайл, КаталогИсходныхФайлов, ДополнительныеПараметры) Экспорт
	
	Сообщить("ОбработатьФайл");
	
	Если КопированиеВыполнено Тогда
		Возврат Ложь;
	КонецЕсли;

	ФайлШаблона = ОбъединитьПути("exts", "rat", "src", "DataProcessors");
	ФайлШаблона = ОбъединитьПути(ФайлШаблона, "РатШагиVA", "Templates", "ЭкспортныеШаги");
	ФайлШаблона = ОбъединитьПути(ФайлШаблона, "Template.txt");
	
	Назначение = ОбъединитьПути("documentation", "docs", "functionality", "ЭкспортируемыеШаги.md");
	ДополнительныеПараметры.Лог.Информация(СтрШаблон("Скопирован файл %1 → %2", ФайлШаблона, Назначение));
	КопироватьФайл(ФайлШаблона, Назначение);
	ДополнительныеПараметры.ИзмененныеКаталоги.Добавить(Назначение);
	КопированиеВыполнено = Истина;
	
	Возврат Истина;

КонецФункции

КопированиеВыполнено = Ложь;
