//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ПередЗаписьюОбъекта
//   Вызывается перед записью объекта (набора регистра) в базу
// Параметры:
//  Объект - Произвольный - сохраняемый объекта. Например, справочник объект, документ объект, набор записей регистра
//  ДанныеЗаписи - Структура - Описание данных переданных в сервис
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновногоОбработчика - Булево - Флаг для отключения обработки стандартным обработчиком
// 
Процедура ПередЗаписьюОбъекта(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновногоОбработчика) Экспорт
	
	// Для отмены записи необходимо зарегистрировать ошибку, см. РатОбщий.ЗафиксироватьОшибку
	ОтказОсновногоОбработчика = Ложь;
	
КонецПроцедуры

// ДанныеСписка
//   Возвращает коллекцию записей таблицы по переданным параметрам
// Параметры:
//  ПараметрыВыборки - Структура - Параметры выборки, см. РатИнформационнаяБаза.ПараметрыВыборки
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Массив из Произвольный - Если выбирается только одна колонка, то результатом будет массив
//  ТаблицаЗначений - Если в выборке указано несколько колонок - таблица значений
Функция ДанныеСписка(ПараметрыВыборки, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДанныеЭлемента
//   Возвращает данные объекта информационной базы
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ИмяТаблицы - Строка - Полное имя таблицы хранения
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура - Данные объекта
//  Неопределено - Если не удалось найти объект по идентификатору, то возвращается неопределено
Функция ДанныеЭлемента(Идентификатор, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// СоздатьЭлемент
//   Создает объект информационной базы 
// Параметры:
//  ДанныеСохраняемогоОбъекта - Структура - Данные сохраняемого объекта (Данные, дополнительные параметры, параметры записи)
//                                         См. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Если объект ссылочного типа - ссылка на созданный объект
//  КлючЗаписи, Массив из Произвольный - Если это запись регистра - ключ записи или массив таких ключей, подробнее см. КлючЗаписиИзНабораЗаписей
Функция СоздатьЭлемент(ДанныеСохраняемогоОбъекта, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ОбновитьЭлемент
//   Изменяет существующий объект информационной базы
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ДанныеСохраняемогоОбъекта - Структура - Данные сохраняемого объекта (Данные, дополнительные параметры, параметры записи)
//                                         См. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура, Неопределено - Описание успешного результата, неопределено - при возникновении ошибок
Функция ОбновитьЭлемент(Идентификатор, ДанныеСохраняемогоОбъекта, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// УдалитьЭлемент
//   Помечает на удаление объект или очищает записи регистра по отбору
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ИмяТаблицы - Строка - Полное имя таблицы хранящей данные
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура, Неопределено - Описание успешного результата, неопределено - при возникновении ошибок
Функция УдалитьЭлемент(Идентификатор, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДвиженияДокументаПоРегистрам
//   Возвращает коллекцию движений документа
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  ИмяТаблицы - Строка - Полное имя таблицы документа
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура - Данные Движений документа:
//    * Ключ - Строка - Имя регистра
//    * Значение - ТаблицаЗначений - Строки записей регистра
Функция ДвиженияДокументаПоРегистрам(Документ, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДвиженияПоРегистру
//   Возвращает строки движений документа по регистру
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  ПолноеИмяРегистра - Строка - Полное имя таблицы регистра
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Строки движений документа по регистру
Функция ДвиженияПоРегистру(Документ, ПолноеИмяРегистра, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// УстановитьДвижения
//   Изменяет записи движений документа по регистру 
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  Данные - Массив из Структура - Новый набор движений документа
//  ПолноеИмяРегистра - Строка - Полное имя таблицы регистра
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура УстановитьДвижения(Документ, Данные, ПолноеИмяРегистра, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

// УстановитьДанные
//   Выполняет перенос преобразованных данных запроса в записываемый в базу объект 
// Параметры:
//  Объект - Произвольный - Объект, который будет записан. Или объект, или набор записей
//  ДанныеЗаписи - Структура - Данные и настройки, которые пришли в запросе, см. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура УстановитьДанные(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

// СохранитьОбъект
//   Записывает объект в базу 
// Параметры:
//  Объект - Произвольный - Объект, который будет записан. Или объект, или набор записей
//  ДанныеЗаписи - Структура - Данные и настройки, которые пришли в запросе, см. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура СохранитьОбъект(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

#КонецОбласти
