//©///////////////////////////////////////////////////////////////////////////©//
//
//  This file is a part of RAT.
//
//  Copyright © 2021-2025
//  BIA-Technologies Limited Liability Company and contributors
//
//  SPDX-License-Identifier: LGPL-3.0-or-later
//
//  RAT is free software: you can redistribute it and/or modify
//  it under the terms of the GNU Lesser General Public License as published by
//  the Free Software Foundation; either version 3 of the License, or
//  (at your option) any later version.
//
//  RAT is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU Lesser General Public License for more details.
//
//  You should have received a copy of the GNU Lesser General Public License
//  along with RAT. If not, see <https://www.gnu.org/licenses/>.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область СлужебныйПрограммныйИнтерфейс

// ПередЗаписьюОбъекта
//   Вызывается перед записью объекта (набора регистра) в базу
// Параметры:
//  Объект - Произвольный - сохраняемый объекта. Например, справочник объект, документ объект, набор записей регистра
//  ДанныеЗаписи - Структура - Описание данных переданных в сервис
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновногоОбработчика - Булево - Флаг для отключения обработки стандартным обработчиком
// 
Процедура ПередЗаписьюОбъекта(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновногоОбработчика) Экспорт
	
	// Для отмены записи необходимо зарегистрировать ошибку, см. РатОбщий.ЗафиксироватьОшибку
	ОтказОсновногоОбработчика = Ложь;
	
КонецПроцедуры

// ДанныеСписка
//   Возвращает коллекцию записей таблицы по переданным параметрам
// Параметры:
//  ПараметрыВыборки - Структура - Параметры выборки, см. РатИнформационнаяБаза.ПараметрыВыборки
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Массив из Произвольный - Если выбирается только одна колонка, то результатом будет массив
//  ТаблицаЗначений - Если в выборке указано несколько колонок - таблица значений
Функция ДанныеСписка(ПараметрыВыборки, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДанныеЭлемента
//   Возвращает данные объекта информационной базы
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ИмяТаблицы - Строка - Полное имя таблицы хранения
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура - Данные объекта
//  Неопределено - Если не удалось найти объект по идентификатору, то возвращается неопределено
Функция ДанныеЭлемента(Идентификатор, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// СоздатьЭлемент
//   Создает объект информационной базы 
// Параметры:
//  ДанныеСохраняемогоОбъекта - Структура - Данные сохраняемого объекта (Данные, дополнительные параметры, параметры записи)
//                                         См. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  ЛюбаяСсылка - Если объект ссылочного типа - ссылка на созданный объект
//  КлючЗаписи, Массив из Произвольный - Если это запись регистра - ключ записи или массив таких ключей, подробнее см. КлючЗаписиИзНабораЗаписей
Функция СоздатьЭлемент(ДанныеСохраняемогоОбъекта, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ОбновитьЭлемент
//   Изменяет существующий объект информационной базы
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ДанныеСохраняемогоОбъекта - Структура - Данные сохраняемого объекта (Данные, дополнительные параметры, параметры записи)
//                                         См. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура, Неопределено - Описание успешного результата, неопределено - при возникновении ошибок
Функция ОбновитьЭлемент(Идентификатор, ДанныеСохраняемогоОбъекта, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// УдалитьЭлемент
//   Помечает на удаление объект или очищает записи регистра по отбору
// Параметры:
//  Идентификатор - ЛюбаяСсылка, КлючЗначения - Идентификатор объекта ИБ
//  ИмяТаблицы - Строка - Полное имя таблицы хранящей данные
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура, Неопределено - Описание успешного результата, неопределено - при возникновении ошибок
Функция УдалитьЭлемент(Идентификатор, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДвиженияДокументаПоРегистрам
//   Возвращает коллекцию движений документа
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  ИмяТаблицы - Строка - Полное имя таблицы документа
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  Структура - Данные Движений документа:
//    * Ключ - Строка - Имя регистра
//    * Значение - ТаблицаЗначений - Строки записей регистра
Функция ДвиженияДокументаПоРегистрам(Документ, ИмяТаблицы, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// ДвиженияПоРегистру
//   Возвращает строки движений документа по регистру
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  ПолноеИмяРегистра - Строка - Полное имя таблицы регистра
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойФункции - Булево - Флаг для отключения выполнения стандартного метода
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Строки движений документа по регистру
Функция ДвиженияПоРегистру(Документ, ПолноеИмяРегистра, СтатусОбработкиЗапроса, ОтказОсновнойФункции) Экспорт
	
	ОтказОсновнойФункции = Ложь;
	Возврат Неопределено;
	
КонецФункции

// УстановитьДвижения
//   Изменяет записи движений документа по регистру 
// Параметры:
//  Документ - ДокументСсылка - Ссылка на документ, движения которого хотим получить
//  Данные - Массив из Структура - Новый набор движений документа
//  ПолноеИмяРегистра - Строка - Полное имя таблицы регистра
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура УстановитьДвижения(Документ, Данные, ПолноеИмяРегистра, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

// УстановитьДанные
//   Выполняет перенос преобразованных данных запроса в записываемый в базу объект 
// Параметры:
//  Объект - Произвольный - Объект, который будет записан. Или объект, или набор записей
//  ДанныеЗаписи - Структура - Данные и настройки, которые пришли в запросе, см. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура УстановитьДанные(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

// СохранитьОбъект
//   Записывает объект в базу 
// Параметры:
//  Объект - Произвольный - Объект, который будет записан. Или объект, или набор записей
//  ДанныеЗаписи - Структура - Данные и настройки, которые пришли в запросе, см. РатИнформационнаяБаза.ДанныеЗаписи
//  СтатусОбработкиЗапроса - См. РатОбщий.НовыйСтатусОбработкиЗапроса
//  ОтказОсновнойПроцедуры - Булево - Флаг для отключения выполнения стандартного метода
Процедура СохранитьОбъект(Объект, ДанныеЗаписи, СтатусОбработкиЗапроса, ОтказОсновнойПроцедуры) Экспорт
	
	ОтказОсновнойПроцедуры = Ложь;
	
КонецПроцедуры

#КонецОбласти
