//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

/////////////////////////////////////////////////////////////////////////////////
// Экспортные процедуры и функции, предназначенные для использования другими 
// объектами конфигурации или другими программами
///////////////////////////////////////////////////////////////////////////////// 
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.Перед("ПолучитьФормуШагов").ВТранзакции()
		.ДобавитьТест("ЯПровожуДокументВнешнейСистемы")
		.ДобавитьТест("ЯОтменяюПроведениеДокументаВнешнейСистемы")
		.ДобавитьТест("ЯУдаляюЗаписиВнешнейСистемыСоответствующиеОтбору")
		.ДобавитьТест("ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив")
		.ДобавитьТест("ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив_РегистрСОднимИзмерением")
		.ДобавитьТест("ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив_РегистрБезИзмерений")
	;
		
КонецПроцедуры

#Область События

Процедура ПолучитьФормуШагов() Экспорт
	
	Ванесса = ПолучитьФорму("Обработка.Мок_Ванесса.Форма.Форма");
	Ванесса.Инициализировать();
	
	Форма = ПолучитьФорму("Обработка.РатШагиVA.Форма.Форма");
	Форма.Контекст = Ванесса.Контекст;
	Форма.КонтекстСохраняемый = Ванесса.КонтекстСохраняемый;
	
	Форма.Ванесса = Ванесса;
	
	ЮТест.Контекст().УстановитьЗначение("Форма", Форма);
	
КонецПроцедуры

#КонецОбласти

Процедура ЯПровожуДокументВнешнейСистемы() Экспорт
	
	Документ = ЮТест.Данные().КонструкторОбъекта("Документ.ПУБ_Чек")
		.Записать();
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Форма.ЯПровожуДокументВнешнейСистемы(ПомощникТестированияРат.ИдентификаторСсылки(Документ), "ЭтаБаза");
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(Документ, "Проведен"), "Документ не проведен")
		.ЭтоИстина();

КонецПроцедуры

Процедура ЯОтменяюПроведениеДокументаВнешнейСистемы() Экспорт
	
	Документ = ЮТест.Данные().КонструкторОбъекта("Документ.ПУБ_Чек")
		.Провести();
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Форма.ЯОтменяюПроведениеДокументаВнешнейСистемы(ПомощникТестированияРат.ИдентификаторСсылки(Документ), "ЭтаБаза");
	
	ЮТест.ОжидаетЧто(ЮТЗапросы.ЗначениеРеквизита(Документ, "Проведен"), "Документ не проведен")
		.ЭтоЛожь();

КонецПроцедуры

Процедура ЯУдаляюЗаписиВнешнейСистемыСоответствующиеОтбору() Экспорт
	
	Объект = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_Номенклатура");
	Комментарий = ЮТест.Данные().СлучайнаяСтрока();
	
	ЮТест.Данные().КонструкторОбъекта("РегистрСведений.ПУБ_КомментарииПоОбъекту")
		.ФикцияОбязательныхПолей()
		.Установить("Объект", Объект)
		.Установить("Комментарий", Комментарий)
		.Записать();
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Условия = ЮТест.Варианты("Кол1, Кол2")
		.Добавить("Период", ТекущаяДата())
		.СписокВариантов();
	
	Форма.ЯУдаляюЗаписиВнешнейСистемыСоответствующиеОтбору("РегистрСведений.ПУБ_КомментарииПоОбъекту", "ЭтаБаза", Условия);
	
КонецПроцедуры

Процедура ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив() Экспорт
	
	ИмяРегистра = "РегистрСведений.ПУБ_КомментарииПоОбъекту";
	Объект = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_Номенклатура");
	ОбъектНовый = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_Номенклатура");
	Комментарий = ЮТест.Данные().СлучайнаяСтрока();
	Период = ЮТест.Данные().СлучайнаяДата();
	
	ЮТест.Данные().КонструкторОбъекта(ИмяРегистра)
		.Установить("Период", Период)
		.Установить("Объект", Объект)
		.Установить("Комментарий", Комментарий)
		.Записать();
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Условия = ТаблицаУсловия(Новый Структура("Период", Период));
	НовыеЗначения = Новый Структура("Объект", ОбъектНовый);
	
	Форма.ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив(ИмяРегистра, "ЭтаБаза", Условия, НовыеЗначения);
	
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра)
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("Период").Равно(Период)
			.Реквизит("Комментарий").Равно(Комментарий)
			.Реквизит("Объект").Равно(ОбъектНовый)
		);
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра)
		.НеСодержитЗаписи(ЮТест.Предикат()
			.Реквизит("Период").Равно(Период)
			.Реквизит("Комментарий").Равно(Комментарий)
			.Реквизит("Объект").Равно(Объект)
		);
КонецПроцедуры

Процедура ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив_РегистрСОднимИзмерением() Экспорт
	
	ИмяРегистра = "РегистрСведений.ПУБ_СтатусыОбъектов";
	Объект = ЮТест.Данные().СоздатьЭлемент("Справочники.ПУБ_Номенклатура");
	Статус = ПредопределенноеЗначение("Перечисление.ПУБ_Статусы.Ожидание");
	СтатусНовый = ПредопределенноеЗначение("Перечисление.ПУБ_Статусы.ВРаботе");
	Описание = ЮТест.Данные().СлучайнаяСтрока();
	
	ЮТест.Данные().КонструкторОбъекта(ИмяРегистра)
		.Установить("Объект", Объект)
		.Установить("Статус", Статус)
		.Установить("Описание", Описание)
		.Записать();
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Начальное состояние записи")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("Объект").Равно(Объект)
			.Реквизит("Статус").Равно(Статус)
			.Реквизит("Описание").Равно(Описание)
		);
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Условия = ТаблицаУсловия(Новый Структура("Объект", Объект));
	НовыеЗначения = Новый Структура("Статус", СтатусНовый);
	
	Форма.ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив(ИмяРегистра, "ЭтаБаза", Условия, НовыеЗначения);
	
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Обновленная запись")
		.СодержитЗаписи(ЮТест.Предикат()
			.Реквизит("Объект").Равно(Объект)
			.Реквизит("Статус").Равно(СтатусНовый)
			.Реквизит("Описание").Равно(Описание)
		);
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Старая запись")
		.НеСодержитЗаписи(ЮТест.Предикат()
			.Реквизит("Объект").Равно(Объект)
			.Реквизит("Статус").Равно(Статус)
			.Реквизит("Описание").Равно(Описание)
		);
	
КонецПроцедуры

Процедура ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив_РегистрБезИзмерений() Экспорт
	
	ИмяРегистра = "РегистрСведений.ПУБ_ПериодическаяКонстанта";
	Период = НачалоДня(ЮТест.Данные().СлучайнаяДата());
	Значение = ЮТест.Данные().СлучайнаяСтрока();
	НовоеЗначение = ЮТест.Данные().СлучайнаяСтрока();
	
	НачальнаяЗапись = Новый Структура("Период, Значение", Период, Значение);
	СоздатьЗаписьРегистра(ИмяРегистра, НачальнаяЗапись);
	
	Форма = ЮТест.Контекст().Значение("Форма");
	Условия = ТаблицаУсловия(Новый Структура("Период", Период));
	НовыеЗначения = Новый Структура("Значение", НовоеЗначение);
	
	Форма.ЯИзменяюЗаписиВнешнейСистемыСоответствующиеОтборуУстановив(ИмяРегистра, "ЭтаБаза", Условия, НовыеЗначения);
	
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Обновленная запись")
		.СодержитЗаписи(ЮТест.Предикат(Новый Структура("Период, Значение", Период, НовоеЗначение)));
	
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Старая запись")
		.НеСодержитЗаписи(ЮТест.Предикат(НачальнаяЗапись));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаУсловия(Отбор)
	
	Таблица = Новый Массив();
	
	Для Каждого Элемент Из Отбор Цикл
		Таблица.Добавить(Новый Структура("Кол1, Кол2", Элемент.Ключ, Элемент.Значение));
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура СоздатьЗаписьРегистра(ИмяРегистра, Данные)
	
	ЮТест.Данные().КонструкторОбъекта(ИмяРегистра)
		.УстановитьРеквизиты(Данные)
		.Записать();
	
	ЮТест.ОжидаетЧтоТаблицаБазы(ИмяРегистра, "Новая запись")
		.СодержитЗаписи(ЮТест.Предикат(Данные));
	
КонецПроцедуры

#КонецОбласти
